[ {
  "index" : 1301,
  "chapter" : 31,
  "number" : 1,
  "asking" : " Which of the following describes a physical location around the world where AWS clusters data centers?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Endpoint"
  }, {
    "option" : "B",
    "description" : " Collection"
  }, {
    "option" : "C",
    "description" : " Fleet"
  }, {
    "option" : "D",
    "description" : " Region"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 1,
    "options" : [ "D" ],
    "description" : "A region is a named set of AWS resources in the same geographical area. A region comprises at least two Availability Zones. Endpoint, Collection, and Fleet do not describe a physical location around the world where AWS clusters data centers."
  }
}, {
  "index" : 1302,
  "chapter" : 31,
  "number" : 2,
  "asking" : " Each AWS region is composed of two or more locations that offer organizations the ability to operate production systems that are more highly available, fault tolerant, and scalable than would be possible using a single data center. What are these locations called?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Availability Zones"
  }, {
    "option" : "B",
    "description" : " Replication areas"
  }, {
    "option" : "C",
    "description" : " Geographic districts"
  }, {
    "option" : "D",
    "description" : " Compute centers"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 2,
    "options" : [ "A" ],
    "description" : "An Availability Zone is a distinct location within a region that is insulated from failures in other Availability Zones and provides inexpensive, low-latency network connectivity to other Availability Zones in the same region. Replication areas, geographic districts, and compute centers are not terms used to describe AWS data center locations."
  }
}, {
  "index" : 1303,
  "chapter" : 31,
  "number" : 3,
  "asking" : " What is the deployment term for an environment that extends an existing on-premises infrastructure into the cloud to connect cloud resources to internal systems?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " All-in deployment"
  }, {
    "option" : "B",
    "description" : " Hybrid deployment"
  }, {
    "option" : "C",
    "description" : " On-premises deployment"
  }, {
    "option" : "D",
    "description" : " Scatter deployment"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 3,
    "options" : [ "B" ],
    "description" : "A hybrid deployment is a way to connect infrastructure and applications between cloud-based resources and existing resources that are not located in the cloud. An all-in deployment refers to an environment that exclusively runs in the cloud. An on-premises deployment refers to an environment that runs exclusively in an organization’s data center."
  }
}, {
  "index" : 1304,
  "chapter" : 31,
  "number" : 4,
  "asking" : " Which AWS Cloud service allows organizations to gain system-wide visibility into resource utilization, application performance, and operational health?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Identity and Access Management (IAM)"
  }, {
    "option" : "B",
    "description" : " Amazon Simple Notification Service (Amazon SNS)"
  }, {
    "option" : "C",
    "description" : " Amazon CloudWatch"
  }, {
    "option" : "D",
    "description" : " AWS CloudFormation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 4,
    "options" : [ "C" ],
    "description" : "Amazon CloudWatch is a monitoring service for AWS Cloud resources and the applications organizations run on AWS. It allows organizations to collect and track metrics, collect and monitor log files, and set alarms. AWS IAM, Amazon SNS, and AWS CloudFormation do not provide visibility into resource utilization, application performance, and the operational health of your AWS resources."
  }
}, {
  "index" : 1305,
  "chapter" : 31,
  "number" : 5,
  "asking" : " Which of the following AWS Cloud services is a fully managed NoSQL database service?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Simple Queue Service (Amazon SQS)"
  }, {
    "option" : "B",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "C",
    "description" : " Amazon ElastiCache"
  }, {
    "option" : "D",
    "description" : " Amazon Relational Database Service (Amazon RDS)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 5,
    "options" : [ "B" ],
    "description" : "Amazon DynamoDB is a fully managed, fast, and flexible NoSQL database service for all applications that need consistent, single-digit millisecond latency at any scale. Amazon SQS, Amazon ElastiCache, and Amazon RDS do not provide a NoSQL database service. Amazon SQS is a managed message queuing service. Amazon ElastiCache is a service that provides in-memory cache in the cloud. Finally, Amazon RDS provides managed relational databases."
  }
}, {
  "index" : 1306,
  "chapter" : 31,
  "number" : 6,
  "asking" : " Your company experiences fluctuations in traffic patterns to their e-commerce website based on flash sales. What service can help your company dynamically match the required compute capacity to the spike in traffic during flash sales?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Auto Scaling"
  }, {
    "option" : "B",
    "description" : " Amazon Glacier"
  }, {
    "option" : "C",
    "description" : " Amazon Simple Notification Service (Amazon SNS)"
  }, {
    "option" : "D",
    "description" : " Amazon Virtual Private Cloud (Amazon VPC)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 6,
    "options" : [ "A" ],
    "description" : "Auto Scaling helps maintain application availability and allows organizations to scale Amazon Elastic Compute Cloud (Amazon EC2) capacity up or down automatically according to conditions defined for the particular workload. Not only can it be used to help ensure that the desired number of Amazon EC2 instances are running, but it also allows resources to scale in and out to match the demands of dynamic workloads. Amazon Glacier, Amazon SNS, and Amazon VPC do not provide services to scale compute capacity automatically."
  }
}, {
  "index" : 1307,
  "chapter" : 31,
  "number" : 7,
  "asking" : " Your company provides an online photo sharing service. The development team is looking for ways to deliver image files with the lowest latency to end users so the website content is delivered with the best possible performance. What service can help speed up distribution of these image files to end users around the world?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Elastic Compute Cloud (Amazon EC2)"
  }, {
    "option" : "B",
    "description" : " Amazon Route 53"
  }, {
    "option" : "C",
    "description" : " AWS Storage Gateway"
  }, {
    "option" : "D",
    "description" : " Amazon CloudFront"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 7,
    "options" : [ "D" ],
    "description" : "Amazon CloudFront is a web service that provides a CDN to speed up distribution of your static and dynamic web content—for example, .html, .css, .php, image, and media files—to end users. Amazon CloudFront delivers content through a worldwide network of edge locations. Amazon EC2, Amazon Route 53, and AWS Storage Gateway do not provide CDN services that are required to meet the needs for the photo sharing service."
  }
}, {
  "index" : 1308,
  "chapter" : 31,
  "number" : 8,
  "asking" : " Your company runs an Amazon Elastic Compute Cloud (Amazon EC2) instance periodically to perform a batch processing job on a large and growing filesystem. At the end of the batch job, you shut down the Amazon EC2 instance to save money but need to persist the filesystem on the Amazon EC2 instance from the previous batch runs. What AWS Cloud service can you leverage to meet these requirements?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Elastic Block Store (Amazon EBS)"
  }, {
    "option" : "B",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "C",
    "description" : " Amazon Glacier"
  }, {
    "option" : "D",
    "description" : " AWS CloudFormation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 8,
    "options" : [ "EC" ],
    "description" : "instances on the AWS Cloud. Amazon DynamoDB, Amazon Glacier, and AWS CloudFormation do not provide persistent block-level storage for Amazon EC2 instances. Amazon DynamoDB provides managed NoSQL databases. Amazon Glacier provides low- cost archival storage. AWS CloudFormation gives developers and systems administrators an easy way to create and manage a collection of related AWS resources."
  }
}, {
  "index" : 1309,
  "chapter" : 31,
  "number" : 9,
  "asking" : " What AWS Cloud service provides a logically isolated section of the AWS Cloud where organizations can launch AWS resources in a virtual network that they define?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Simple Workflow Service (Amazon SWF)"
  }, {
    "option" : "B",
    "description" : " Amazon Route 53"
  }, {
    "option" : "C",
    "description" : " Amazon Virtual Private Cloud (Amazon VPC)"
  }, {
    "option" : "D",
    "description" : " AWS CloudFormation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 9,
    "options" : [ "C" ],
    "description" : "Amazon VPC lets organizations provision a logically isolated section of the AWS Cloud where they can launch AWS resources in a virtual network that they define. Amazon SWF, Amazon Route 53, and AWS CloudFormation do not provide a virtual network. Amazon SWF helps developers build, run, and scale background jobs that have parallel or sequential steps. Amazon Route 53 provides a highly available and scalable cloud Domain Name System (DNS) web service. Amazon CloudFormation gives developers and systems administrators an easy way to create and manage a collection of related AWS resources."
  }
}, {
  "index" : 1310,
  "chapter" : 31,
  "number" : 10,
  "asking" : " Your company provides a mobile voting application for a popular TV show, and 5 to 25 million viewers all vote in a 15-second timespan. What mechanism can you use to decouple the voting application from your back-end services that tally the votes?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS CloudTrail"
  }, {
    "option" : "B",
    "description" : " Amazon Simple Queue Service (Amazon SQS)"
  }, {
    "option" : "C",
    "description" : " Amazon Redshift"
  }, {
    "option" : "D",
    "description" : " Amazon Simple Notification Service (Amazon SNS)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 1,
    "number" : 10,
    "options" : [ "B" ],
    "description" : "Amazon SQS is a fast, reliable, scalable, fully managed message queuing service that allows organizations to decouple the components of a cloud application. With Amazon SQS, organizations can transmit any volume of data, at any level of throughput, without losing messages or requiring other services to be always available. AWS CloudTrail records AWS API calls, and Amazon Redshift is a data warehouse, neither of which would be useful as an architecture component for decoupling components. Amazon SNS provides a messaging bus complement to Amazon SQS; however, it doesn’t provide the decoupling of components necessary for this scenario."
  }
}, {
  "index" : 1311,
  "chapter" : 32,
  "number" : 1,
  "asking" : " In what ways does Amazon Simple Storage Service (Amazon S3) object storage differ from block and file storage? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon S3 stores data in fixed size blocks."
  }, {
    "option" : "B",
    "description" : " Objects are identified by a numbered address."
  }, {
    "option" : "C",
    "description" : " Objects can be any size."
  }, {
    "option" : "D",
    "description" : " Objects contain both data and metadata."
  }, {
    "option" : "E",
    "description" : " Objects are stored in buckets."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 1,
    "options" : [ "D", "E" ],
    "description" : "Objects are stored in buckets, and objects contain both data and metadata."
  }
}, {
  "index" : 1312,
  "chapter" : 32,
  "number" : 2,
  "asking" : " Which of the following are not appropriates use cases for Amazon Simple Storage Service (Amazon S3)? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Storing web content"
  }, {
    "option" : "B",
    "description" : " Storing a file system mounted to an Amazon Elastic Compute Cloud (Amazon EC2) instance"
  }, {
    "option" : "C",
    "description" : " Storing backups for a relational database"
  }, {
    "option" : "D",
    "description" : " Primary storage for a database"
  }, {
    "option" : "E",
    "description" : " Storing logs for analytics"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 2,
    "options" : [ "B", "D" ],
    "description" : "Amazon S3 cannot be mounted to an Amazon EC2 instance like a file system and should not serve as primary database storage."
  }
}, {
  "index" : 1313,
  "chapter" : 32,
  "number" : 3,
  "asking" : " What are some of the key characteristics of Amazon Simple Storage Service (Amazon S3)? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " All objects have a URL."
  }, {
    "option" : "B",
    "description" : " Amazon S3 can store unlimited amounts of data."
  }, {
    "option" : "C",
    "description" : " Objects are world-readable by default."
  }, {
    "option" : "D",
    "description" : " Amazon S3 uses a REST (Representational State Transfer) Application Program Interface (API)."
  }, {
    "option" : "E",
    "description" : " You must pre-allocate the storage in a bucket."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 3,
    "options" : [ "A", "B", "D" ],
    "description" : "C and E are incorrect—objects are private by default, and storage in a bucket does not need to be pre-allocated."
  }
}, {
  "index" : 1314,
  "chapter" : 32,
  "number" : 4,
  "asking" : " Which features can be used to restrict access to Amazon Simple Storage Service (Amazon S3) data? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Enable static website hosting on the bucket."
  }, {
    "option" : "B",
    "description" : " Create a pre-signed URL for an object."
  }, {
    "option" : "C",
    "description" : " Use an Amazon S3 Access Control List (ACL) on a bucket or object."
  }, {
    "option" : "D",
    "description" : " Use a lifecycle policy."
  }, {
    "option" : "E",
    "description" : " Use an Amazon S3 bucket policy."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 4,
    "options" : [ "B", "C", "E" ],
    "description" : "Static website hosting does not restrict data access, and neither does an Amazon S3 lifecycle policy."
  }
}, {
  "index" : 1315,
  "chapter" : 32,
  "number" : 5,
  "asking" : " Your application stores critical data in Amazon Simple Storage Service (Amazon S3), which must be protected against inadvertent or intentional deletion. How can this data be protected? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use cross-region replication to copy data to another bucket automatically."
  }, {
    "option" : "B",
    "description" : " Set a vault lock."
  }, {
    "option" : "C",
    "description" : " Enable versioning on the bucket."
  }, {
    "option" : "D",
    "description" : " Use a lifecycle policy to migrate data to Amazon Glacier."
  }, {
    "option" : "E",
    "description" : " Enable MFA Delete on the bucket."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 5,
    "options" : [ "C", "E" ],
    "description" : "Versioning protects data against inadvertent or intentional deletion by storing all versions of the object, and MFA Delete requires a one-time code from a Multi-Factor Authentication (MFA) device to delete objects. Cross-region replication and migration to the Amazon Glacier storage class do not protect against deletion. Vault locks are a feature of Amazon Glacier, not a feature of Amazon S3."
  }
}, {
  "index" : 1316,
  "chapter" : 32,
  "number" : 6,
  "asking" : " Your company stores documents in Amazon Simple Storage Service (Amazon S3), but it wants to minimize cost. Most documents are used actively for only about a month, then much less frequently. However, all data needs to be available within minutes when requested. How can you meet these requirements?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Migrate the data to Amazon S3 Reduced Redundancy Storage (RRS) after 30 days."
  }, {
    "option" : "B",
    "description" : " Migrate the data to Amazon Glacier after 30 days."
  }, {
    "option" : "C",
    "description" : " Migrate the data to Amazon S3 Standard – Infrequent Access (IA) after 30 days."
  }, {
    "option" : "D",
    "description" : " Turn on versioning, then migrate the older version to Amazon Glacier."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 6,
    "options" : [ "C" ],
    "description" : "Migrating the data to Amazon S3 Standard-IA after 30 days using a lifecycle policy is correct. Amazon S3 RRS should only be used for easily replicated data, not critical data. Migration to Amazon Glacier might minimize storage costs if retrievals are infrequent, but documents would not be available in minutes when needed."
  }
}, {
  "index" : 1317,
  "chapter" : 32,
  "number" : 7,
  "asking" : " How is data stored in Amazon Simple Storage Service (Amazon S3) for high durability?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Data is automatically replicated to other regions."
  }, {
    "option" : "B",
    "description" : " Data is automatically replicated within a region."
  }, {
    "option" : "C",
    "description" : " Data is replicated only if versioning is enabled on the bucket."
  }, {
    "option" : "D",
    "description" : " Data is automatically backed up on tape and restored if needed."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 7,
    "options" : [ "B" ],
    "description" : "Data is automatically replicated within a region. Replication to other regions and versioning are optional. Amazon S3 data is not backed up to tape."
  }
}, {
  "index" : 1318,
  "chapter" : 32,
  "number" : 8,
  "asking" : " Based on the following Amazon Simple Storage Service (Amazon S3) URL, which one of the following statements is correct? https://bucket1.abc.com.s3.amazonaws.com/folderx/myfile.doc",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The object “myfile.doc” is stored in the folder “folderx” in the bucket “bucket1.abc.com.”"
  }, {
    "option" : "B",
    "description" : " The object “myfile.doc” is stored in the bucket “bucket1.abc.com.”"
  }, {
    "option" : "C",
    "description" : " The object “folderx/myfile.doc” is stored in the bucket “bucket1.abc.com.”"
  }, {
    "option" : "D",
    "description" : " The object “myfile.doc” is stored in the bucket “bucket1.”"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 8,
    "options" : [ "C" ],
    "description" : "In a URL, the bucket name precedes the string “s3.amazonaws.com/,” and the object key is everything after that. There is no folder structure in Amazon S3."
  }
}, {
  "index" : 1319,
  "chapter" : 32,
  "number" : 9,
  "asking" : " To have a record of who accessed your Amazon Simple Storage Service (Amazon S3) data and from where, you should do what?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Enable versioning on the bucket."
  }, {
    "option" : "B",
    "description" : " Enable website hosting on the bucket."
  }, {
    "option" : "C",
    "description" : " Enable server access logs on the bucket."
  }, {
    "option" : "D",
    "description" : " Create an AWS Identity and Access Management (IAM) bucket policy."
  }, {
    "option" : "E",
    "description" : " Enable Amazon CloudWatch logs."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 9,
    "options" : [ "C" ],
    "description" : "Amazon S3 server access logs store a record of what requestor accessed the objects in your bucket, including the requesting IP address."
  }
}, {
  "index" : 1320,
  "chapter" : 32,
  "number" : 10,
  "asking" : " What are some reasons to enable cross-region replication on an Amazon Simple Storage Service (Amazon S3) bucket? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " You want a backup of your data in case of accidental deletion."
  }, {
    "option" : "B",
    "description" : " You have a set of users or customers who can access the second bucket with lower latency."
  }, {
    "option" : "C",
    "description" : " For compliance reasons, you need to store data in a location at least 300 miles away from the first region."
  }, {
    "option" : "D",
    "description" : " Your data needs at least five nines of durability."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 10,
    "options" : [ "B", "C" ],
    "description" : "Cross-region replication can help lower latency and satisfy compliance requirements on distance. Amazon S3 is designed for eleven nines durability for objects in a single region, so a second region does not significantly increase durability. Cross- region replication does not protect against accidental deletion."
  }
}, {
  "index" : 1321,
  "chapter" : 32,
  "number" : 11,
  "asking" : " Your company requires that all data sent to external storage be encrypted before being sent. Which Amazon Simple Storage Service (Amazon S3) encryption solution will meet this requirement?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Server-Side Encryption (SSE) with AWS-managed keys (SSE-S3)"
  }, {
    "option" : "B",
    "description" : " SSE with customer-provided keys (SSE-C)"
  }, {
    "option" : "C",
    "description" : " Client-side encryption with customer-managed keys"
  }, {
    "option" : "D",
    "description" : " Server-side encryption with AWS Key Management Service (AWS KMS) keys (SSE- KMS)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 11,
    "options" : [ "C" ],
    "description" : "If data must be encrypted before being sent to Amazon S3, client-side encryption must be used."
  }
}, {
  "index" : 1322,
  "chapter" : 32,
  "number" : 12,
  "asking" : " You have a popular web application that accesses data stored in an Amazon Simple Storage Service (Amazon S3) bucket. You expect the access to be very read-intensive, with expected request rates of up to 500 GETs per second from many clients. How can you increase the performance and scalability of Amazon S3 in this case?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Turn on cross-region replication to ensure that data is served from multiple locations."
  }, {
    "option" : "B",
    "description" : " Ensure randomness in the namespace by including a hash prefix to key names."
  }, {
    "option" : "C",
    "description" : " Turn on server access logging."
  }, {
    "option" : "D",
    "description" : " Ensure that key names are sequential to enable pre-fetch."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 12,
    "options" : [ "B" ],
    "description" : "Amazon S3 scales automatically, but for request rates over 100 GETS per second, it helps to make sure there is some randomness in the key space. Replication and logging will not affect performance or scalability. Using sequential key names could have a negative effect on performance or scalability."
  }
}, {
  "index" : 1323,
  "chapter" : 32,
  "number" : 13,
  "asking" : " What is needed before you can enable cross-region replication on an Amazon Simple Storage Service (Amazon S3) bucket? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Enable versioning on the bucket."
  }, {
    "option" : "B",
    "description" : " Enable a lifecycle rule to migrate data to the second region."
  }, {
    "option" : "C",
    "description" : " Enable static website hosting."
  }, {
    "option" : "D",
    "description" : " Create an AWS Identity and Access Management (IAM) policy to allow Amazon S3 to replicate objects on your behalf."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 13,
    "options" : [ "A", "D" ],
    "description" : "You must enable versioning before you can enable cross-region replication, and Amazon S3 must have IAM permissions to perform the replication. Lifecycle rules migrate data from one storage class to another, not from one bucket to another. Static website hosting is not a prerequisite for replication."
  }
}, {
  "index" : 1324,
  "chapter" : 32,
  "number" : 14,
  "asking" : " Your company has 100TB of financial records that need to be stored for seven years by law. Experience has shown that any record more than one-year old is unlikely to be accessed. Which of the following storage plans meets these needs in the most cost efficient manner?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Store the data on Amazon Elastic Block Store (Amazon EBS) volumes attached to t2.micro instances."
  }, {
    "option" : "B",
    "description" : " Store the data on Amazon Simple Storage Service (Amazon S3) with lifecycle policies that change the storage class to Amazon Glacier after one year and delete the object after seven years."
  }, {
    "option" : "C",
    "description" : " Store the data in Amazon DynamoDB and run daily script to delete data older than seven years."
  }, {
    "option" : "D",
    "description" : " Store the data in Amazon Elastic MapReduce (Amazon EMR)."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 14,
    "options" : [ "B" ],
    "description" : "Amazon S3 is the most cost effective storage on AWS, and lifecycle policies are a simple and effective feature to address the business requirements."
  }
}, {
  "index" : 1325,
  "chapter" : 32,
  "number" : 15,
  "asking" : " Amazon Simple Storage Service (S3) bucket policies can restrict access to an Amazon S3 bucket and objects by which of the following? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Company name"
  }, {
    "option" : "B",
    "description" : " IP address range"
  }, {
    "option" : "C",
    "description" : " AWS account"
  }, {
    "option" : "D",
    "description" : " Country of origin"
  }, {
    "option" : "E",
    "description" : " Objects with a specific prefix"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 15,
    "options" : [ "B", "C", "E" ],
    "description" : "Amazon S3 bucket policies cannot specify a company name or a country or origin, but they can specify request IP range, AWS account, and a prefix for objects that can be accessed."
  }
}, {
  "index" : 1326,
  "chapter" : 32,
  "number" : 16,
  "asking" : " Amazon Simple Storage Service (Amazon S3) is an eventually consistent storage system. For what kinds of operations is it possible to get stale data as a result of eventual consistency? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " GET after PUT of a new object"
  }, {
    "option" : "B",
    "description" : " GET or LIST after a DELETE"
  }, {
    "option" : "C",
    "description" : " GET after overwrite PUT (PUT to an existing key)"
  }, {
    "option" : "D",
    "description" : " DELETE after PUT of new object"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 16,
    "options" : [ "B", "C" ],
    "description" : "Amazon S3 provides read-after-write consistency for PUTs to new objects (new key), but eventual consistency for GETs and DELETEs of existing objects (existing key)."
  }
}, {
  "index" : 1327,
  "chapter" : 32,
  "number" : 17,
  "asking" : " What must be done to host a static website in an Amazon Simple Storage Service (Amazon S3) bucket? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Configure the bucket for static hosting and specify an index and error document."
  }, {
    "option" : "B",
    "description" : " Create a bucket with the same name as the website."
  }, {
    "option" : "C",
    "description" : " Enable File Transfer Protocol (FTP) on the bucket."
  }, {
    "option" : "D",
    "description" : " Make the objects in the bucket world-readable."
  }, {
    "option" : "E",
    "description" : " Enable HTTP on the bucket."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 17,
    "options" : [ "A", "B", "D" ],
    "description" : "A, B, and D are required, and normally you also set a friendly CNAME to the bucket URL. Amazon S3 does not support FTP transfers, and HTTP does not need to be enabled."
  }
}, {
  "index" : 1328,
  "chapter" : 32,
  "number" : 18,
  "asking" : " You have valuable media files hosted on AWS and want them to be served only to authenticated users of your web application. You are concerned that your content could be stolen and distributed for free. How can you protect your content?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use static web hosting."
  }, {
    "option" : "B",
    "description" : " Generate pre-signed URLs for content in the web application."
  }, {
    "option" : "C",
    "description" : " Use AWS Identity and Access Management (IAM) policies to restrict access."
  }, {
    "option" : "D",
    "description" : " Use logging to track your content."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 18,
    "options" : [ "B" ],
    "description" : "Pre-signed URLs allow you to grant time-limited permission to download objects from an Amazon Simple Storage Service (Amazon S3) bucket. Static web hosting generally requires world-read access to all content. AWS IAM policies do not know who the authenticated users of the web app are. Logging can help track content loss, but not prevent it."
  }
}, {
  "index" : 1329,
  "chapter" : 32,
  "number" : 19,
  "asking" : " Amazon Glacier is well-suited to data that is which of the following? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Is infrequently or rarely accessed"
  }, {
    "option" : "B",
    "description" : " Must be immediately available when needed"
  }, {
    "option" : "C",
    "description" : " Is available after a three- to five-hour restore period"
  }, {
    "option" : "D",
    "description" : " Is frequently erased within 30 days"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 19,
    "options" : [ "A", "C" ],
    "description" : "Amazon Glacier is optimized for long-term archival storage and is not suited to data that needs immediate access or short-lived data that is erased within 90 days."
  }
}, {
  "index" : 1330,
  "chapter" : 32,
  "number" : 20,
  "asking" : " Which statements about Amazon Glacier are true? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Glacier stores data in objects that live in archives."
  }, {
    "option" : "B",
    "description" : " Amazon Glacier archives are identified by user-specified key names."
  }, {
    "option" : "C",
    "description" : " Amazon Glacier archives take three to five hours to restore."
  }, {
    "option" : "D",
    "description" : " Amazon Glacier vaults can be locked."
  }, {
    "option" : "E",
    "description" : " Amazon Glacier can be used as a standalone service and as an Amazon S3 storage class."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 2,
    "number" : 20,
    "options" : [ "C", "D", "E" ],
    "description" : "Amazon Glacier stores data in archives, which are contained in vaults. Archives are identified by system-created archive IDs, not key names."
  }
}, {
  "index" : 1331,
  "chapter" : 33,
  "number" : 1,
  "asking" : " Your web application needs four instances to support steady traffic nearly all of the time. On the last day of each month, the traffic triples. What is a cost-effective way to handle this traffic pattern?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Run 12 Reserved Instances all of the time."
  }, {
    "option" : "B",
    "description" : " Run four On-Demand Instances constantly, then add eight more On-Demand Instances on the last day of each month."
  }, {
    "option" : "C",
    "description" : " Run four Reserved Instances constantly, then add eight On-Demand Instances on the last day of each month."
  }, {
    "option" : "D",
    "description" : " Run four On-Demand Instances constantly, then add eight Reserved Instances on the last day of each month."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 1,
    "options" : [ "C" ],
    "description" : "Reserved Instances provide cost savings when you can commit to running instances full time, such as to handle the base traffic. On-Demand Instances provide the flexibility to handle traffic spikes, such as on the last day of the month."
  }
}, {
  "index" : 1332,
  "chapter" : 33,
  "number" : 2,
  "asking" : " Your order-processing application processes orders extracted from a queue with two Reserved Instances processing 10 orders/minute. If an order fails during processing, then it is returned to the queue without penalty. Due to a weekend sale, the queues have several hundred orders backed up. While the backup is not catastrophic, you would like to drain it so that customers get their confirmation emails faster. What is a cost-effective way to drain the queue for orders?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create more queues."
  }, {
    "option" : "B",
    "description" : " Deploy additional Spot Instances to assist in processing the orders."
  }, {
    "option" : "C",
    "description" : " Deploy additional Reserved Instances to assist in processing the orders."
  }, {
    "option" : "D",
    "description" : " Deploy additional On-Demand Instances to assist in processing the orders."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 2,
    "options" : [ "B" ],
    "description" : "Spot Instances are a very cost-effective way to address temporary compute needs that are not urgent and are tolerant of interruption. That’s exactly the workload described here. Reserved Instances are inappropriate for temporary workloads. On-Demand Instances are good for temporary workloads, but don’t offer the cost savings of Spot Instances. Adding more queues is a non-responsive answer as it would not address the problem."
  }
}, {
  "index" : 1333,
  "chapter" : 33,
  "number" : 3,
  "asking" : " Which of the following must be specified when launching a new Amazon Elastic Compute Cloud (Amazon EC2) Windows instance? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The Amazon EC2 instance ID"
  }, {
    "option" : "B",
    "description" : " Password for the administrator account"
  }, {
    "option" : "C",
    "description" : " Amazon EC2 instance type"
  }, {
    "option" : "D",
    "description" : " Amazon Machine Image (AMI)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 3,
    "options" : [ "C", "D" ],
    "description" : "The Amazon EC2 instance ID will be assigned by AWS as part of the launch process. The administrator password is assigned by AWS and encrypted via the public key. The instance type defines the virtual hardware and the AMI defines the initial software state. You must specify both upon launch."
  }
}, {
  "index" : 1334,
  "chapter" : 33,
  "number" : 4,
  "asking" : " You have purchased an m3.xlarge Linux Reserved instance in us-east-1a. In which ways can you modify this reservation? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Change it into two m3.large instances."
  }, {
    "option" : "B",
    "description" : " Change it to a Windows instance."
  }, {
    "option" : "C",
    "description" : " Move it to us-east-1b."
  }, {
    "option" : "D",
    "description" : " Change it to an m4.xlarge."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 4,
    "options" : [ "A", "C" ],
    "description" : "You can change the instance type only within the same instance type family, or you can change the Availability Zone. You cannot change the operating system nor the instance type family."
  }
}, {
  "index" : 1335,
  "chapter" : 33,
  "number" : 5,
  "asking" : " Your instance is associated with two security groups. The first allows Remote Desktop Protocol (RDP) access over port 3389 from Classless Inter-Domain Routing (CIDR) block 72.14.0.0/16. The second allows HTTP access over port 80 from CIDR block 0.0.0.0/0. What traffic can reach your instance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " RDP and HTTP access from CIDR block 0.0.0.0/0"
  }, {
    "option" : "B",
    "description" : " No traffic is allowed."
  }, {
    "option" : "C",
    "description" : " RDP and HTTP traffic from 72.14.0.0/16"
  }, {
    "option" : "D",
    "description" : " RDP traffic over port 3389 from 72.14.0.0/16 and HTTP traffic over port 80 from 0.0.00/0"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 5,
    "options" : [ "D" ],
    "description" : "When there are multiple security groups associated with an instance, all the rules are aggregated."
  }
}, {
  "index" : 1336,
  "chapter" : 33,
  "number" : 6,
  "asking" : " Which of the following are features of enhanced networking? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " More Packets Per Second (PPS)"
  }, {
    "option" : "B",
    "description" : " Lower latency"
  }, {
    "option" : "C",
    "description" : " Multiple network interfaces"
  }, {
    "option" : "D",
    "description" : " Border Gateway Protocol (BGP) routing"
  }, {
    "option" : "E",
    "description" : " Less jitter"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 6,
    "options" : [ "A", "B", "E" ],
    "description" : "These are the benefits of enhanced networking."
  }
}, {
  "index" : 1337,
  "chapter" : 33,
  "number" : 7,
  "asking" : " You are creating a High-Performance Computing (HPC) cluster and need very low latency and high bandwidth between instances. What combination of the following will allow this? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use an instance type with 10 Gbps network performance."
  }, {
    "option" : "B",
    "description" : " Put the instances in a placement group."
  }, {
    "option" : "C",
    "description" : " Use Dedicated Instances."
  }, {
    "option" : "D",
    "description" : " Enable enhanced networking on the instances."
  }, {
    "option" : "E",
    "description" : " Use Reserved Instances."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 7,
    "options" : [ "A", "B", "D" ],
    "description" : "The other answers have nothing to do with networking."
  }
}, {
  "index" : 1338,
  "chapter" : 33,
  "number" : 8,
  "asking" : " Which Amazon Elastic Compute Cloud (Amazon EC2) feature ensures that your instances will not share a physical host with instances from any other AWS customer?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Virtual Private Cloud (VPC)"
  }, {
    "option" : "B",
    "description" : " Placement groups"
  }, {
    "option" : "C",
    "description" : " Dedicated Instances"
  }, {
    "option" : "D",
    "description" : " Reserved Instances"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 8,
    "options" : [ "C" ],
    "description" : "Dedicated Instances will not share hosts with other accounts."
  }
}, {
  "index" : 1339,
  "chapter" : 33,
  "number" : 9,
  "asking" : " Which of the following are true of instance stores? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Automatic backups"
  }, {
    "option" : "B",
    "description" : " Data is lost when the instance stops."
  }, {
    "option" : "C",
    "description" : " Very high IOPS"
  }, {
    "option" : "D",
    "description" : " Charge is based on the total amount of storage provisioned."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 9,
    "options" : [ "B", "C" ],
    "description" : "Instance stores are low-durability, high-IOPS storage that is included for free with the hourly cost of an instance."
  }
}, {
  "index" : 1340,
  "chapter" : 33,
  "number" : 10,
  "asking" : " Which of the following are features of Amazon Elastic Block Store (Amazon EBS)? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Data stored on Amazon EBS is automatically replicated within an Availability Zone."
  }, {
    "option" : "B",
    "description" : " Amazon EBS data is automatically backed up to tape."
  }, {
    "option" : "C",
    "description" : " Amazon EBS volumes can be encrypted transparently to workloads on the attached instance."
  }, {
    "option" : "D",
    "description" : " Data on an Amazon EBS volume is lost when the attached instance is stopped."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 10,
    "options" : [ "A", "C" ],
    "description" : "There are no tapes in the AWS infrastructure. Amazon EBS volumes persist when the instance is stopped. The data is automatically replicated within an Availability Zone. Amazon EBS volumes can be encrypted upon creation and used by an instance in the same manner as if they were not encrypted."
  }
}, {
  "index" : 1341,
  "chapter" : 33,
  "number" : 11,
  "asking" : " You need to take a snapshot of an Amazon Elastic Block Store (Amazon EBS) volume. How long will the volume be unavailable?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " It depends on the provisioned size of the volume."
  }, {
    "option" : "B",
    "description" : " The volume will be available immediately."
  }, {
    "option" : "C",
    "description" : " It depends on the amount of data stored on the volume."
  }, {
    "option" : "D",
    "description" : " It depends on whether the attached instance is an Amazon EBS-optimized instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 11,
    "options" : [ "B" ],
    "description" : "There is no delay in processing when commencing a snapshot."
  }
}, {
  "index" : 1342,
  "chapter" : 33,
  "number" : 12,
  "asking" : " You are restoring an Amazon Elastic Block Store (Amazon EBS) volume from a snapshot. How long will it be before the data is available?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " It depends on the provisioned size of the volume."
  }, {
    "option" : "B",
    "description" : " The data will be available immediately."
  }, {
    "option" : "C",
    "description" : " It depends on the amount of data stored on the volume."
  }, {
    "option" : "D",
    "description" : " It depends on whether the attached instance is an Amazon EBS-optimized instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 12,
    "options" : [ "B" ],
    "description" : "The volume is created immediately but the data is loaded lazily. This means that the volume can be accessed upon creation, and if the data being requested has not yet been restored, it will be restored upon first request."
  }
}, {
  "index" : 1343,
  "chapter" : 33,
  "number" : 13,
  "asking" : " You have a workload that requires 15,000 consistent IOPS for data that must be durable. What combination of the following steps do you need? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use an Amazon Elastic Block Store (Amazon EBS)-optimized instance."
  }, {
    "option" : "B",
    "description" : " Use an instance store."
  }, {
    "option" : "C",
    "description" : " Use a Provisioned IOPS SSD volume."
  }, {
    "option" : "D",
    "description" : " Use a magnetic volume."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 13,
    "options" : [ "A", "C" ],
    "description" : "B and D are incorrect because an instance store will not be durable and a magnetic volume offers an average of 100 IOPS. Amazon EBS-optimized instances reserve network bandwidth on the instance for IO, and Provisioned IOPS SSD volumes provide the highest consistent IOPS."
  }
}, {
  "index" : 1344,
  "chapter" : 33,
  "number" : 14,
  "asking" : " Which of the following can be accomplished through bootstrapping?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Install the most current security updates."
  }, {
    "option" : "B",
    "description" : " Install the current version of the application."
  }, {
    "option" : "C",
    "description" : " Configure Operating System (OS) services."
  }, {
    "option" : "D",
    "description" : " All of the above."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 14,
    "options" : [ "D" ],
    "description" : "Bootstrapping runs the provided script, so anything you can accomplish in a script you can accomplish during bootstrapping."
  }
}, {
  "index" : 1345,
  "chapter" : 33,
  "number" : 15,
  "asking" : " How can you connect to a new Linux instance using SSH?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Decrypt the root password."
  }, {
    "option" : "B",
    "description" : " Using a certificate"
  }, {
    "option" : "C",
    "description" : " Using the private half of the instance’s key pair"
  }, {
    "option" : "D",
    "description" : " Using Multi-Factor Authentication (MFA)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 15,
    "options" : [ "C" ],
    "description" : "The public half of the key pair is stored on the instance, and the private half can then be used to connect via SSH."
  }
}, {
  "index" : 1346,
  "chapter" : 33,
  "number" : 16,
  "asking" : " VM Import/Export can import existing virtual machines as: (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Elastic Block Store (Amazon EBS) volumes"
  }, {
    "option" : "B",
    "description" : " Amazon Elastic Compute Cloud (Amazon EC2) instances"
  }, {
    "option" : "C",
    "description" : " Amazon Machine Images (AMIs)"
  }, {
    "option" : "D",
    "description" : " Security groups"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 16,
    "options" : [ "B", "C" ],
    "description" : "These are the possible outputs of VM Import/Export."
  }
}, {
  "index" : 1347,
  "chapter" : 33,
  "number" : 17,
  "asking" : " Which of the following can be used to address an Amazon Elastic Compute Cloud (Amazon EC2) instance over the web? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Windows machine name"
  }, {
    "option" : "B",
    "description" : " Public DNS name"
  }, {
    "option" : "C",
    "description" : " Amazon EC2 instance ID"
  }, {
    "option" : "D",
    "description" : " Elastic IP address"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 17,
    "options" : [ "B", "D" ],
    "description" : "Neither the Windows machine name nor the Amazon EC2 instance ID can be resolved into an IP address to access the instance."
  }
}, {
  "index" : 1348,
  "chapter" : 33,
  "number" : 18,
  "asking" : " Using the correctly decrypted Administrator password and RDP, you cannot log in to a Windows instance you just launched. Which of the following is a possible reason?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " There is no security group rule that allows RDP access over port 3389 from your IP address."
  }, {
    "option" : "B",
    "description" : " The instance is a Reserved Instance."
  }, {
    "option" : "C",
    "description" : " The instance is not using enhanced networking."
  }, {
    "option" : "D",
    "description" : " The instance is not an Amazon EBS-optimized instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 18,
    "options" : [ "A" ],
    "description" : "None of the other options will have any effect on the ability to connect."
  }
}, {
  "index" : 1349,
  "chapter" : 33,
  "number" : 19,
  "asking" : " You have a workload that requires 1 TB of durable block storage at 1,500 IOPS during normal use. Every night there is an Extract, Transform, Load (ETL) task that requires 3,000 IOPS for 15 minutes. What is the most appropriate volume type for this workload?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use a Provisioned IOPS SSD volume at 3,000 IOPS."
  }, {
    "option" : "B",
    "description" : " Use an instance store."
  }, {
    "option" : "C",
    "description" : " Use a general-purpose SSD volume."
  }, {
    "option" : "D",
    "description" : " Use a magnetic volume."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 19,
    "options" : [ "C" ],
    "description" : "A short period of heavy traffic is exactly the use case for the bursting nature of general-purpose SSD volumes—the rest of the day is more than enough time to build up enough IOPS credits to handle the nightly task. Instance stores are not durable, magnetic volumes cannot provide enough IOPS, and to set up a Provisioned IOPS SSD volume to handle the peak would mean spending money for more IOPS than you need."
  }
}, {
  "index" : 1350,
  "chapter" : 33,
  "number" : 20,
  "asking" : " How are you billed for elastic IP addresses?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Hourly when they are associated with an instance"
  }, {
    "option" : "B",
    "description" : " Hourly when they are not associated with an instance"
  }, {
    "option" : "C",
    "description" : " Based on the data that flows through them"
  }, {
    "option" : "D",
    "description" : " Based on the instance type to which they are attached"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 3,
    "number" : 20,
    "options" : [ "B" ],
    "description" : "There is a very small hourly charge for allocated elastic IP addresses that are not associated with an instance."
  }
}, {
  "index" : 1351,
  "chapter" : 34,
  "number" : 1,
  "asking" : " What is the minimum size subnet that you can have in an Amazon VPC?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " /24"
  }, {
    "option" : "B",
    "description" : " /26"
  }, {
    "option" : "C",
    "description" : " /28"
  }, {
    "option" : "D",
    "description" : " /30"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 1,
    "options" : [ "C" ],
    "description" : "The minimum size subnet that you can have in an Amazon VPC is /28."
  }
}, {
  "index" : 1352,
  "chapter" : 34,
  "number" : 2,
  "asking" : " You are a solutions architect working for a large travel company that is migrating its existing server estate to AWS. You have recommended that they use a custom Amazon VPC, and they have agreed to proceed. They will need a public subnet for their web servers and a private subnet in which to place their databases. They also require that the web servers and database servers be highly available and that there be a minimum of two web servers and two database servers each. How many subnets should you have to maintain high availability?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 2"
  }, {
    "option" : "B",
    "description" : " 3"
  }, {
    "option" : "C",
    "description" : " 4"
  }, {
    "option" : "D",
    "description" : " 1"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 2,
    "options" : [ "C" ],
    "description" : "You need two public subnets (one for each Availability Zone) and two private subnets (one for each Availability Zone). Therefore, you need four subnets."
  }
}, {
  "index" : 1353,
  "chapter" : 34,
  "number" : 3,
  "asking" : " Which of the following is an optional security control that can be applied at the subnet layer of a VPC?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Network ACL"
  }, {
    "option" : "B",
    "description" : " Security Group"
  }, {
    "option" : "C",
    "description" : " Firewall"
  }, {
    "option" : "D",
    "description" : " Web application firewall"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 3,
    "options" : [ "A" ],
    "description" : "Network ACLs are associated to a VPC subnet to control traffic flow."
  }
}, {
  "index" : 1354,
  "chapter" : 34,
  "number" : 4,
  "asking" : " What is the maximum size IP address range that you can have in an Amazon VPC?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " /16"
  }, {
    "option" : "B",
    "description" : " /24"
  }, {
    "option" : "C",
    "description" : " /28"
  }, {
    "option" : "D",
    "description" : " /30"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "The maximum size subnet that you can have in a VPC is /16."
  }
}, {
  "index" : 1355,
  "chapter" : 34,
  "number" : 5,
  "asking" : " You create a new subnet and then add a route to your route table that routes traffic out from that subnet to the Internet using an IGW. What type of subnet have you created?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An internal subnet"
  }, {
    "option" : "B",
    "description" : " A private subnet"
  }, {
    "option" : "C",
    "description" : " An external subnet"
  }, {
    "option" : "D",
    "description" : " A public subnet"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 5,
    "options" : [ "D" ],
    "description" : "By creating a route out to the Internet using an IGW, you have made this subnet public."
  }
}, {
  "index" : 1356,
  "chapter" : 34,
  "number" : 6,
  "asking" : " What happens when you create a new Amazon VPC?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A main route table is created by default."
  }, {
    "option" : "B",
    "description" : " Three subnets are created by default—one for each Availability Zone."
  }, {
    "option" : "C",
    "description" : " Three subnets are created by default in one Availability Zone."
  }, {
    "option" : "D",
    "description" : " An IGW is created by default."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 6,
    "options" : [ "A" ],
    "description" : "When you create an Amazon VPC, a route table is created by default. You must manually create subnets and an IGW."
  }
}, {
  "index" : 1357,
  "chapter" : 34,
  "number" : 7,
  "asking" : " You create a new VPC in US-East-1 and provision three subnets inside this Amazon VPC. Which of the following statements is true?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " By default, these subnets will not be able to communicate with each other; you will need to create routes."
  }, {
    "option" : "B",
    "description" : " All subnets are public by default."
  }, {
    "option" : "C",
    "description" : " All subnets will be able to communicate with each other by default."
  }, {
    "option" : "D",
    "description" : " Each subnet will have identical CIDR blocks."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 7,
    "options" : [ "C" ],
    "description" : "When you provision an Amazon VPC, all subnets can communicate with each other by default."
  }
}, {
  "index" : 1358,
  "chapter" : 34,
  "number" : 8,
  "asking" : " How many IGWs can you attach to an Amazon VPC at any one time?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1"
  }, {
    "option" : "B",
    "description" : " 2"
  }, {
    "option" : "C",
    "description" : " 3"
  }, {
    "option" : "D",
    "description" : " 4"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 8,
    "options" : [ "A" ],
    "description" : "You may only have one IGW for each Amazon VPC."
  }
}, {
  "index" : 1359,
  "chapter" : 34,
  "number" : 9,
  "asking" : " What aspect of an Amazon VPC is stateful?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Network ACLs"
  }, {
    "option" : "B",
    "description" : " Security groups"
  }, {
    "option" : "C",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "D",
    "description" : " Amazon S3"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 9,
    "options" : [ "B" ],
    "description" : "Security groups are stateful, whereas network ACLs are stateless."
  }
}, {
  "index" : 1360,
  "chapter" : 34,
  "number" : 10,
  "asking" : " You have created a custom Amazon VPC with both private and public subnets. You have created a NAT instance and deployed this instance to a public subnet. You have attached an EIP address and added your NAT to the route table. Unfortunately, instances in your private subnet still cannot access the Internet. What may be the cause of this?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Your NAT is in a public subnet, but it needs to be in a private subnet."
  }, {
    "option" : "B",
    "description" : " Your NAT should be behind an Elastic Load Balancer."
  }, {
    "option" : "C",
    "description" : " You should disable source/destination checks on the NAT."
  }, {
    "option" : "D",
    "description" : " Your NAT has been deployed on a Windows instance, but your other instances are Linux. You should redeploy the NAT onto a Linux instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 10,
    "options" : [ "C" ],
    "description" : "You should disable source/destination checks on the NAT."
  }
}, {
  "index" : 1361,
  "chapter" : 34,
  "number" : 11,
  "asking" : " Which of the following will occur when an Amazon Elastic Block Store (Amazon EBS)- backed Amazon EC2 instance in an Amazon VPC with an associated EIP is stopped and started? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The EIP will be dissociated from the instance."
  }, {
    "option" : "B",
    "description" : " All data on instance-store devices will be lost."
  }, {
    "option" : "C",
    "description" : " All data on Amazon EBS devices will be lost."
  }, {
    "option" : "D",
    "description" : " The ENI is detached."
  }, {
    "option" : "E",
    "description" : " The underlying host for the instance is changed."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 11,
    "options" : [ "B", "E" ],
    "description" : "In the EC2-Classic network, the EIP will be disassociated with the instance; in the EC2-VPC network, the EIP remains associated with the instance. Regardless of the underlying network, a stop/start of an Amazon EBS-backed Amazon EC2 instance always changes the host computer."
  }
}, {
  "index" : 1362,
  "chapter" : 34,
  "number" : 12,
  "asking" : " How many VPC Peering connections are required for four VPCs located within the same AWS region to be able to send traffic to each of the others?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 3"
  }, {
    "option" : "B",
    "description" : " 4"
  }, {
    "option" : "C",
    "description" : " 5"
  }, {
    "option" : "D",
    "description" : " 6"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 12,
    "options" : [ "D" ],
    "description" : "Six VPC Peering connections are needed for each of the four VPCs to send traffic to the other."
  }
}, {
  "index" : 1363,
  "chapter" : 34,
  "number" : 13,
  "asking" : " Which of the following AWS resources would you use in order for an EC2-VPC instance to resolve DNS names outside of AWS?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A VPC peering connection"
  }, {
    "option" : "B",
    "description" : " A DHCP option set"
  }, {
    "option" : "C",
    "description" : " A routing rule"
  }, {
    "option" : "D",
    "description" : " An IGW"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 13,
    "options" : [ "B" ],
    "description" : "A DHCP option set allows customers to define DNS servers for DNS name resolution, establish domain names for instances within an Amazon VPC, define NTP servers, and define the NetBIOS name servers."
  }
}, {
  "index" : 1364,
  "chapter" : 34,
  "number" : 14,
  "asking" : " Which of the following is the Amazon side of an Amazon VPN connection?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An EIP"
  }, {
    "option" : "B",
    "description" : " A CGW"
  }, {
    "option" : "C",
    "description" : " An IGW"
  }, {
    "option" : "D",
    "description" : " A VPG"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 14,
    "options" : [ "D" ],
    "description" : "A CGW is the customer side of a VPN connection, and an IGW connects a network to the Internet. A VPG is the Amazon side of a VPN connection."
  }
}, {
  "index" : 1365,
  "chapter" : 34,
  "number" : 15,
  "asking" : " What is the default limit for the number of Amazon VPCs that a customer may have in a region?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 5"
  }, {
    "option" : "B",
    "description" : " 6"
  }, {
    "option" : "C",
    "description" : " 7"
  }, {
    "option" : "D",
    "description" : " There is no default maximum number of VPCs within a region."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 15,
    "options" : [ "A" ],
    "description" : "The default limit for the number of Amazon VPCs that a customer may have in a region is 5."
  }
}, {
  "index" : 1366,
  "chapter" : 34,
  "number" : 16,
  "asking" : " You are responsible for your company’s AWS resources, and you notice a significant amount of traffic from an IP address in a foreign country in which your company does not have customers. Further investigation of the traffic indicates the source of the traffic is scanning for open ports on your EC2-VPC instances. Which one of the following resources can deny the traffic from reaching the instances?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Security group"
  }, {
    "option" : "B",
    "description" : " Network ACL"
  }, {
    "option" : "C",
    "description" : " NAT instance"
  }, {
    "option" : "D",
    "description" : " An Amazon VPC endpoint"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 16,
    "options" : [ "B" ],
    "description" : "Network ACL rules can deny traffic."
  }
}, {
  "index" : 1367,
  "chapter" : 34,
  "number" : 17,
  "asking" : " Which of the following is the security protocol supported by Amazon VPC?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " SSH"
  }, {
    "option" : "B",
    "description" : " Advanced Encryption Standard (AES)"
  }, {
    "option" : "C",
    "description" : " Point-to-Point Tunneling Protocol (PPTP)"
  }, {
    "option" : "D",
    "description" : " IPsec"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 17,
    "options" : [ "D" ],
    "description" : "IPsec is the security protocol supported by Amazon VPC."
  }
}, {
  "index" : 1368,
  "chapter" : 34,
  "number" : 18,
  "asking" : " Which of the following Amazon VPC resources would you use in order for EC2-VPC instances to send traffic directly to Amazon S3?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon S3 gateway"
  }, {
    "option" : "B",
    "description" : " IGW"
  }, {
    "option" : "C",
    "description" : " CGW"
  }, {
    "option" : "D",
    "description" : " VPC endpoint"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 18,
    "options" : [ "D" ],
    "description" : "An Amazon VPC endpoint enables you to create a private connection between your Amazon VPC and another AWS service without requiring access over the Internet or through a NAT device, VPN connection, or AWS Direct Connect."
  }
}, {
  "index" : 1369,
  "chapter" : 34,
  "number" : 19,
  "asking" : " What properties of an Amazon VPC must be specified at the time of creation? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The CIDR block representing the IP address range"
  }, {
    "option" : "B",
    "description" : " One or more subnets for the Amazon VPC"
  }, {
    "option" : "C",
    "description" : " The region for the Amazon VPC"
  }, {
    "option" : "D",
    "description" : " Amazon VPC Peering relationships"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 19,
    "options" : [ "A", "C" ],
    "description" : "The CIDR block is specified upon creation and cannot be changed. An Amazon VPC is associated with exactly one region which must be specified upon creation. You can add a subnet to an Amazon VPC any time after it has been created, provided its address range falls within the Amazon VPC CIDR block and does not overlap with the address range of any existing CIDR block. You can set up peering relationships between Amazon VPCs after they have been created."
  }
}, {
  "index" : 1370,
  "chapter" : 34,
  "number" : 20,
  "asking" : " Which Amazon VPC feature allows you to create a dual-homed instance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " EIP address"
  }, {
    "option" : "B",
    "description" : " ENI"
  }, {
    "option" : "C",
    "description" : " Security groups"
  }, {
    "option" : "D",
    "description" : " CGW"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 4,
    "number" : 20,
    "options" : [ "B" ],
    "description" : "Attaching an ENI associated with a different subnet to an instance can make the instance dual-homed."
  }
}, {
  "index" : 1371,
  "chapter" : 35,
  "number" : 1,
  "asking" : " Which of the following are required elements of an Auto Scaling group? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Minimum size"
  }, {
    "option" : "B",
    "description" : " Health checks"
  }, {
    "option" : "C",
    "description" : " Desired capacity"
  }, {
    "option" : "D",
    "description" : " Launch configuration"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 1,
    "options" : [ "A", "D" ],
    "description" : "An Auto Scaling group must have a minimum size and a launch configuration defined in order to be created. Health checks and a desired capacity are optional."
  }
}, {
  "index" : 1372,
  "chapter" : 35,
  "number" : 2,
  "asking" : " You have created an Elastic Load Balancing load balancer listening on port 80, and you registered it with a single Amazon Elastic Compute Cloud (Amazon EC2) instance also listening on port 80. A client makes a request to the load balancer with the correct protocol and port for the load balancer. In this scenario, how many connections does the balancer maintain?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1"
  }, {
    "option" : "B",
    "description" : " 2"
  }, {
    "option" : "C",
    "description" : " 3"
  }, {
    "option" : "D",
    "description" : " 4"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 2,
    "options" : [ "B" ],
    "description" : "The load balancer maintains two separate connections: one connection with the client and one connection with the Amazon EC2 instance."
  }
}, {
  "index" : 1373,
  "chapter" : 35,
  "number" : 3,
  "asking" : " How long does Amazon CloudWatch keep metric data?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1 day"
  }, {
    "option" : "B",
    "description" : " 2 days"
  }, {
    "option" : "C",
    "description" : " 1 week"
  }, {
    "option" : "D",
    "description" : " 2 weeks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 3,
    "options" : [ "D" ],
    "description" : "Amazon CloudWatch metric data is kept for 2 weeks."
  }
}, {
  "index" : 1374,
  "chapter" : 35,
  "number" : 4,
  "asking" : " Which of the following are the minimum required elements to create an Auto Scaling launch configuration?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Launch configuration name, Amazon Machine Image (AMI), and instance type"
  }, {
    "option" : "B",
    "description" : " Launch configuration name, AMI, instance type, and key pair"
  }, {
    "option" : "C",
    "description" : " Launch configuration name, AMI, instance type, key pair, and security group"
  }, {
    "option" : "D",
    "description" : " Launch configuration name, AMI, instance type, key pair, security group, and block device mapping"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "Only the launch configuration name, AMI, and instance type are needed to create an Auto Scaling launch configuration. Identifying a key pair, security group, and a block device mapping are optional elements for an Auto Scaling launch configuration."
  }
}, {
  "index" : 1375,
  "chapter" : 35,
  "number" : 5,
  "asking" : " You are responsible for the application logging solution for your company’s existing applications running on multiple Amazon EC2 instances. Which of the following is the best approach for aggregating the application logs within AWS?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon CloudWatch custom metrics"
  }, {
    "option" : "B",
    "description" : " Amazon CloudWatch Logs Agent"
  }, {
    "option" : "C",
    "description" : " An Elastic Load Balancing listener"
  }, {
    "option" : "D",
    "description" : " An internal Elastic Load Balancing load balancer"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 5,
    "options" : [ "B" ],
    "description" : "You can use the Amazon CloudWatch Logs Agent installer on existing Amazon EC2 instances to install and configure the CloudWatch Logs Agent."
  }
}, {
  "index" : 1376,
  "chapter" : 35,
  "number" : 6,
  "asking" : " Which of the following must be configured on an Elastic Load Balancing load balancer to accept incoming traffic?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A port"
  }, {
    "option" : "B",
    "description" : " A network interface"
  }, {
    "option" : "C",
    "description" : " A listener"
  }, {
    "option" : "D",
    "description" : " An instance"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 6,
    "options" : [ "C" ],
    "description" : "You configure your load balancer to accept incoming traffic by specifying one or more listeners."
  }
}, {
  "index" : 1377,
  "chapter" : 35,
  "number" : 7,
  "asking" : " You create an Auto Scaling group in a new region that is configured with a minimum size value of 10, a maximum size value of 100, and a desired capacity value of 50. However, you notice that 30 of the Amazon Elastic Compute Cloud (Amazon EC2) instances within the Auto Scaling group fail to launch. Which of the following is the cause of this behavior?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " You cannot define an Auto Scaling group larger than 20."
  }, {
    "option" : "B",
    "description" : " The Auto Scaling group maximum value cannot be more than 20."
  }, {
    "option" : "C",
    "description" : " You did not attach an Elastic Load Balancing load balancer to the Auto Scaling group."
  }, {
    "option" : "D",
    "description" : " You have not raised your default Amazon EC2 capacity (20) for the new region."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 7,
    "options" : [ "D" ],
    "description" : "The default Amazon EC2 instance limit for all regions is 20."
  }
}, {
  "index" : 1378,
  "chapter" : 35,
  "number" : 8,
  "asking" : " You want to host multiple Hypertext Transfer Protocol Secure (HTTPS) websites on a fleet of Amazon EC2 instances behind an Elastic Load Balancing load balancer with a single X.509 certificate. How must you configure the Secure Sockets Layer (SSL) certificate so that clients connecting to the load balancer are not presented with a warning when they connect?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create one SSL certificate with a Subject Alternative Name (SAN) value for each website name."
  }, {
    "option" : "B",
    "description" : " Create one SSL certificate with the Server Name Indication (SNI) value checked."
  }, {
    "option" : "C",
    "description" : " Create multiple SSL certificates with a SAN value for each website name."
  }, {
    "option" : "D",
    "description" : " Create SSL certificates for each Availability Zone with a SAN value for each website name."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 8,
    "options" : [ "A" ],
    "description" : "An SSL certificate must specify the name of the website in either the subject name or listed as a value in the SAN extension of the certificate in order for connecting clients to not receive a warning."
  }
}, {
  "index" : 1379,
  "chapter" : 35,
  "number" : 9,
  "asking" : " Your web application front end consists of multiple Amazon Compute Cloud (Amazon EC2) instances behind an Elastic Load Balancing load balancer. You have configured the load balancer to perform health checks on these Amazon EC2 instances. If an instance fails to pass health checks, which statement will be true?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The instance is replaced automatically by the load balancer."
  }, {
    "option" : "B",
    "description" : " The instance is terminated automatically by the load balancer."
  }, {
    "option" : "C",
    "description" : " The load balancer stops sending traffic to the instance that failed its health check."
  }, {
    "option" : "D",
    "description" : " The instance is quarantined by the load balancer for root cause analysis."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 9,
    "options" : [ "C" ],
    "description" : "When Amazon EC2 instances fail the requisite number of consecutive health checks, the load balancer stops sending traffic to the Amazon EC2 instance."
  }
}, {
  "index" : 1380,
  "chapter" : 35,
  "number" : 10,
  "asking" : " In the basic monitoring package for Amazon Elastic Compute Cloud (Amazon EC2), what Amazon CloudWatch metrics are available?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Web server visible metrics such as number of failed transaction requests"
  }, {
    "option" : "B",
    "description" : " Operating system visible metrics such as memory utilization"
  }, {
    "option" : "C",
    "description" : " Database visible metrics such as number of connections"
  }, {
    "option" : "D",
    "description" : " Hypervisor visible metrics such as CPU utilization"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 10,
    "options" : [ "D" ],
    "description" : "Amazon CloudWatch metrics provide hypervisor visible metrics."
  }
}, {
  "index" : 1381,
  "chapter" : 35,
  "number" : 11,
  "asking" : " A cell phone company is running dynamic-content television commercials for a contest. They want their website to handle traffic spikes that come after a commercial airs. The website is interactive, offering personalized content to each visitor based on location, purchase history, and the current commercial airing. Which architecture will configure Auto Scaling to scale out to respond to spikes of demand, while minimizing costs during quiet periods?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Set the minimum size of the Auto Scaling group so that it can handle high traffic volumes without needing to scale out."
  }, {
    "option" : "B",
    "description" : " Create an Auto Scaling group large enough to handle peak traffic loads, and then stop some instances. Configure Auto Scaling to scale out when traffic increases using the stopped instances, so new capacity will come online quickly."
  }, {
    "option" : "C",
    "description" : " Configure Auto Scaling to scale out as traffic increases. Configure the launch configuration to start new instances from a preconfigured Amazon Machine Image (AMI)."
  }, {
    "option" : "D",
    "description" : " Use Amazon CloudFront and Amazon Simple Storage Service (Amazon S3) to cache changing content, with the Auto Scaling group set as the origin. Configure Auto Scaling to have sufficient instances necessary to initially populate CloudFront and Amazon ElastiCache, and then scale in after the cache is fully populated."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 11,
    "options" : [ "C" ],
    "description" : "Auto Scaling is designed to scale out based on an event like increased traffic while being cost effective when not needed."
  }
}, {
  "index" : 1382,
  "chapter" : 35,
  "number" : 12,
  "asking" : " For an application running in the ap-northeast-1 region with three Availability Zones (ap- northeast-1a, ap-northeast-1b, and ap-northeast-1c), which instance deployment provides high availability for the application that normally requires nine running Amazon Elastic Compute Cloud (Amazon EC2) instances but can run on a minimum of 65 percent capacity while Auto Scaling launches replacement instances in the remaining Availability Zones?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Deploy the application on four servers in ap-northeast-1a and five servers in ap- northeast-1b, and keep five stopped instances in ap-northeast-1a as reserve."
  }, {
    "option" : "B",
    "description" : " Deploy the application on three servers in ap-northeast-1a, three servers in ap- northeast-1b, and three servers in ap-northeast-1c."
  }, {
    "option" : "C",
    "description" : " Deploy the application on six servers in ap-northeast-1b and three servers in ap- northeast-1c."
  }, {
    "option" : "D",
    "description" : " Deploy the application on nine servers in ap-northeast-1b, and keep nine stopped instances in ap-northeast-1a as reserve."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 12,
    "options" : [ "B" ],
    "description" : "Auto Scaling will provide high availability across three Availability Zones with three Amazon EC2 instances in each and keep capacity above the required minimum capacity, even in the event of an entire Availability Zone becoming unavailable."
  }
}, {
  "index" : 1383,
  "chapter" : 35,
  "number" : 13,
  "asking" : " Which of the following are characteristics of the Auto Scaling service on AWS? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Sends traffic to healthy instances"
  }, {
    "option" : "B",
    "description" : " Responds to changing conditions by adding or terminating Amazon Elastic Compute Cloud (Amazon EC2) instances"
  }, {
    "option" : "C",
    "description" : " Collects and tracks metrics and sets alarms"
  }, {
    "option" : "D",
    "description" : " Delivers push notifications"
  }, {
    "option" : "E",
    "description" : " Launches instances from a specified Amazon Machine Image (AMI)"
  }, {
    "option" : "F",
    "description" : " Enforces a minimum number of running Amazon EC2 instances"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 13,
    "options" : [ "B", "E", "F" ],
    "description" : "Auto Scaling responds to changing conditions by adding or terminating instances, launches instances from an AMI specified in the launch configuration associated with the Auto Scaling group, and enforces a minimum number of instances in the min-size parameter of the Auto Scaling group."
  }
}, {
  "index" : 1384,
  "chapter" : 35,
  "number" : 14,
  "asking" : " Why is the launch configuration referenced by the Auto Scaling group instead of being part of the Auto Scaling group?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " It allows you to change the Amazon Elastic Compute Cloud (Amazon EC2) instance type and Amazon Machine Image (AMI) without disrupting the Auto Scaling group."
  }, {
    "option" : "B",
    "description" : " It facilitates rolling out a patch to an existing set of instances managed by an Auto Scaling group."
  }, {
    "option" : "C",
    "description" : " It allows you to change security groups associated with the instances launched without having to make changes to the Auto Scaling group."
  }, {
    "option" : "D",
    "description" : " All of the above"
  }, {
    "option" : "E",
    "description" : " None of the above"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 14,
    "options" : [ "D" ],
    "description" : "A, B, and C are all true statements about launch configurations being loosely coupled and referenced by the Auto Scaling group instead of being part of the Auto Scaling group."
  }
}, {
  "index" : 1385,
  "chapter" : 35,
  "number" : 15,
  "asking" : " An Auto Scaling group may use: (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " On-Demand Instances"
  }, {
    "option" : "B",
    "description" : " Stopped instances"
  }, {
    "option" : "C",
    "description" : " Spot Instances"
  }, {
    "option" : "D",
    "description" : " On-premises instances"
  }, {
    "option" : "E",
    "description" : " Already running instances if they use the same Amazon Machine Image (AMI) as the Auto Scaling group’s launch configuration and are not already part of another Auto Scaling group"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 15,
    "options" : [ "A", "C" ],
    "description" : "An Auto Scaling group may use On-Demand and Spot Instances. An Auto Scaling group may not use already stopped instances, instances running someplace other than AWS, and already running instances not started by the Auto Scaling group itself."
  }
}, {
  "index" : 1386,
  "chapter" : 35,
  "number" : 16,
  "asking" : " Amazon CloudWatch supports which types of monitoring plans? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Basic monitoring, which is free"
  }, {
    "option" : "B",
    "description" : " Basic monitoring, which has an additional cost"
  }, {
    "option" : "C",
    "description" : " Ad hoc monitoring, which is free"
  }, {
    "option" : "D",
    "description" : " Ad hoc monitoring, which has an additional cost"
  }, {
    "option" : "E",
    "description" : " Detailed monitoring, which is free"
  }, {
    "option" : "F",
    "description" : " Detailed monitoring, which has an additional cost"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 16,
    "options" : [ "A", "F" ],
    "description" : "Amazon CloudWatch has two plans: basic, which is free, and detailed, which has an additional cost. There is no ad hoc plan for Amazon CloudWatch."
  }
}, {
  "index" : 1387,
  "chapter" : 35,
  "number" : 17,
  "asking" : " Elastic Load Balancing health checks may be: (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A ping"
  }, {
    "option" : "B",
    "description" : " A key pair verification"
  }, {
    "option" : "C",
    "description" : " A connection attempt"
  }, {
    "option" : "D",
    "description" : " A page request"
  }, {
    "option" : "E",
    "description" : " An Amazon Elastic Compute Cloud (Amazon EC2) instance status check"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 17,
    "options" : [ "A", "C", "D" ],
    "description" : "An Elastic Load Balancing health check may be a ping, a connection attempt, or a page that is checked."
  }
}, {
  "index" : 1388,
  "chapter" : 35,
  "number" : 18,
  "asking" : " When an Amazon Elastic Compute Cloud (Amazon EC2) instance registered with an Elastic Load Balancing load balancer using connection draining is deregistered or unhealthy, which of the following will happen? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Immediately close all existing connections to that instance."
  }, {
    "option" : "B",
    "description" : " Keep the connections open to that instance, and attempt to complete in-flight requests."
  }, {
    "option" : "C",
    "description" : " Redirect the requests to a user-defined error page like “Oops this is embarrassing” or “Under Construction.”"
  }, {
    "option" : "D",
    "description" : " Forcibly close all connections to that instance after a timeout period."
  }, {
    "option" : "E",
    "description" : " Leave the connections open as long as the load balancer is running."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 18,
    "options" : [ "B", "C" ],
    "description" : "When connection draining is enabled, the load balancer will stop sending requests to a deregistered or unhealthy instance and attempt to complete in-flight requests until a connection draining timeout period is reached, which is 300 seconds by default."
  }
}, {
  "index" : 1389,
  "chapter" : 35,
  "number" : 19,
  "asking" : " Elastic Load Balancing supports which of the following types of load balancers? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Cross-region"
  }, {
    "option" : "B",
    "description" : " Internet-facing"
  }, {
    "option" : "C",
    "description" : " Interim"
  }, {
    "option" : "D",
    "description" : " Itinerant"
  }, {
    "option" : "E",
    "description" : " Internal"
  }, {
    "option" : "F",
    "description" : " Hypertext Transfer Protocol Secure (HTTPS) using Secure Sockets Layer (SSL)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 19,
    "options" : [ "B", "E", "F" ],
    "description" : "Elastic Load Balancing supports Internet-facing, internal, and HTTPS load balancers."
  }
}, {
  "index" : 1390,
  "chapter" : 35,
  "number" : 20,
  "asking" : " Auto Scaling supports which of the following plans for Auto Scaling groups? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Predictive"
  }, {
    "option" : "B",
    "description" : " Manual"
  }, {
    "option" : "C",
    "description" : " Preemptive"
  }, {
    "option" : "D",
    "description" : " Scheduled"
  }, {
    "option" : "E",
    "description" : " Dynamic"
  }, {
    "option" : "F",
    "description" : " End-user request driven"
  }, {
    "option" : "G",
    "description" : " Optimistic"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 5,
    "number" : 20,
    "options" : [ "B", "D", "E" ],
    "description" : "Auto Scaling supports maintaining the current size of an Auto Scaling group using four plans: maintain current levels, manual scaling, scheduled scaling, and dynamic scaling."
  }
}, {
  "index" : 1391,
  "chapter" : 36,
  "number" : 1,
  "asking" : " Which of the following methods will allow an application using an AWS SDK to be authenticated as a principal to access AWS Cloud services? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create an IAM user and store the user name and password for the user in the application’s configuration."
  }, {
    "option" : "B",
    "description" : " Create an IAM user and store both parts of the access key for the user in the application’s configuration."
  }, {
    "option" : "C",
    "description" : " Run the application on an Amazon EC2 instance with an assigned IAM role."
  }, {
    "option" : "D",
    "description" : " Make all the API calls over an SSL connection."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 1,
    "options" : [ "B", "C" ],
    "description" : "Programmatic access is authenticated with an access key, not with user names/passwords. IAM roles provide a temporary security token to an application using an SDK."
  }
}, {
  "index" : 1392,
  "chapter" : 36,
  "number" : 2,
  "asking" : " Which of the following are found in an IAM policy? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Service Name"
  }, {
    "option" : "B",
    "description" : " Region"
  }, {
    "option" : "C",
    "description" : " Action"
  }, {
    "option" : "D",
    "description" : " Password"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 2,
    "options" : [ "A", "C" ],
    "description" : "IAM policies are independent of region, so no region is specified in the policy. IAM policies are about authorization for an already-authenticated principal, so no password is needed."
  }
}, {
  "index" : 1393,
  "chapter" : 36,
  "number" : 3,
  "asking" : " Your AWS account administrator left your company today. The administrator had access to the root user and a personal IAM administrator account. With these accounts, he generated other IAM accounts and keys. Which of the following should you do today to protect your AWS infrastructure? (Choose 4 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Change the password and add MFA to the root user."
  }, {
    "option" : "B",
    "description" : " Put an IP restriction on the root user."
  }, {
    "option" : "C",
    "description" : " Rotate keys and change passwords for IAM accounts."
  }, {
    "option" : "D",
    "description" : " Delete all IAM accounts."
  }, {
    "option" : "E",
    "description" : " Delete the administrator’s personal IAM account."
  }, {
    "option" : "F",
    "description" : " Relaunch all Amazon EC2 instances with new roles."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 3,
    "options" : [ "A", "B", "C", "E" ],
    "description" : "Locking down your root user and all accounts to which the administrator had access is the key here. Deleting all IAM accounts is not necessary, and it would cause great disruption to your operations. Amazon EC2 roles use temporary security tokens, so relaunching Amazon EC2 instances is not necessary."
  }
}, {
  "index" : 1394,
  "chapter" : 36,
  "number" : 4,
  "asking" : " Which of the following actions can be authorized by IAM? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Installing ASP.NET on a Windows Server"
  }, {
    "option" : "B",
    "description" : " Launching an Amazon Linux EC2 instance"
  }, {
    "option" : "C",
    "description" : " Querying an Oracle database"
  }, {
    "option" : "D",
    "description" : " Adding a message to an Amazon Simple Queue Service (Amazon SQS) queue"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 4,
    "options" : [ "B", "D" ],
    "description" : "IAM controls access to AWS resources only. Installing ASP.NET will require Windows operating system authorization, and querying an Oracle database will require Oracle authorization."
  }
}, {
  "index" : 1395,
  "chapter" : 36,
  "number" : 5,
  "asking" : " Which of the following are IAM security features? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Password policies"
  }, {
    "option" : "B",
    "description" : " Amazon DynamoDB global secondary indexes"
  }, {
    "option" : "C",
    "description" : " MFA"
  }, {
    "option" : "D",
    "description" : " Consolidated Billing"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 5,
    "options" : [ "A", "C" ],
    "description" : "Amazon DynamoDB global secondary indexes are a performance feature of Amazon DynamoDB; Consolidated Billing is an accounting feature allowing all bills to roll up under a single account. While both are very valuable features, neither is a security feature."
  }
}, {
  "index" : 1396,
  "chapter" : 36,
  "number" : 6,
  "asking" : " Which of the following are benefits of using Amazon EC2 roles? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " No policies are required."
  }, {
    "option" : "B",
    "description" : " Credentials do not need to be stored on the Amazon EC2 instance."
  }, {
    "option" : "C",
    "description" : " Key rotation is not necessary."
  }, {
    "option" : "D",
    "description" : " Integration with Active Directory is automatic."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 6,
    "options" : [ "B", "C" ],
    "description" : "Amazon EC2 roles must still be assigned a policy. Integration with Active Directory involves integration between Active Directory and IAM via SAML."
  }
}, {
  "index" : 1397,
  "chapter" : 36,
  "number" : 7,
  "asking" : " Which of the following are based on temporary security tokens? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon EC2 roles"
  }, {
    "option" : "B",
    "description" : " MFA"
  }, {
    "option" : "C",
    "description" : " Root user"
  }, {
    "option" : "D",
    "description" : " Federation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 7,
    "options" : [ "A", "D" ],
    "description" : "Amazon EC2 roles provide a temporary token to applications running on the instance; federation maps policies to identities from other sources via temporary tokens."
  }
}, {
  "index" : 1398,
  "chapter" : 36,
  "number" : 8,
  "asking" : " Your security team is very concerned about the vulnerability of the IAM administrator user accounts (the accounts used to configure all IAM features and accounts). What steps can be taken to lock down these accounts? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Add multi-factor authentication (MFA) to the accounts."
  }, {
    "option" : "B",
    "description" : " Limit logins to a particular U.S. state."
  }, {
    "option" : "C",
    "description" : " Implement a password policy on the AWS account."
  }, {
    "option" : "D",
    "description" : " Apply a source IP address condition to the policy that only grants permissions when the user is on the corporate network."
  }, {
    "option" : "E",
    "description" : " Add a CAPTCHA test to the accounts."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 8,
    "options" : [ "A", "C", "D" ],
    "description" : "Neither B nor E are features supported by IAM."
  }
}, {
  "index" : 1399,
  "chapter" : 36,
  "number" : 9,
  "asking" : " You want to grant the individuals on your network team the ability to fully manipulate Amazon EC2 instances. Which of the following accomplish this goal? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create a new policy allowing EC2:* actions, and name the policy NetworkTeam."
  }, {
    "option" : "B",
    "description" : " Assign the managed policy, EC2FullAccess, to a group named NetworkTeam, and assign all the team members’ IAM user accounts to that group."
  }, {
    "option" : "C",
    "description" : " Create a new policy that grants EC2:* actions on all resources, and assign that policy to each individual’s IAM user account on the network team."
  }, {
    "option" : "D",
    "description" : " Create a NetworkTeam IAM group, and have each team member log in to the AWS Management Console using the user name/password for the group."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 9,
    "options" : [ "B", "C" ],
    "description" : "Access requires an appropriate policy associated with a principal. Response A is merely a policy with no principal, and response D is not a principal as IAM groups do not have user names and passwords. Response B is the best solution; response C will also work but it is much harder to manage."
  }
}, {
  "index" : 1400,
  "chapter" : 36,
  "number" : 10,
  "asking" : " What is the format of an IAM policy?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " XML"
  }, {
    "option" : "B",
    "description" : " Key/value pairs"
  }, {
    "option" : "C",
    "description" : " JSON"
  }, {
    "option" : "D",
    "description" : " Tab-delimited text"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 6,
    "number" : 10,
    "options" : [ "C" ],
    "description" : "An IAM policy is a JSON document."
  }
}, {
  "index" : 1401,
  "chapter" : 37,
  "number" : 1,
  "asking" : " Which AWS database service is best suited for traditional Online Transaction Processing (OLTP)?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Redshift"
  }, {
    "option" : "B",
    "description" : " Amazon Relational Database Service (Amazon RDS)"
  }, {
    "option" : "C",
    "description" : " Amazon Glacier"
  }, {
    "option" : "D",
    "description" : " Elastic Database"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 1,
    "options" : [ "B" ],
    "description" : "Amazon RDS is best suited for traditional OLTP transactions. Amazon Redshift, on the other hand, is designed for OLAP workloads. Amazon Glacier is designed for cold archival storage."
  }
}, {
  "index" : 1402,
  "chapter" : 37,
  "number" : 2,
  "asking" : " Which AWS database service is best suited for non-relational databases?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Redshift"
  }, {
    "option" : "B",
    "description" : " Amazon Relational Database Service (Amazon RDS)"
  }, {
    "option" : "C",
    "description" : " Amazon Glacier"
  }, {
    "option" : "D",
    "description" : " Amazon DynamoDB"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 2,
    "options" : [ "D" ],
    "description" : "Amazon DynamoDB is best suited for non-relational databases. Amazon RDS and Amazon Redshift are both structured relational databases."
  }
}, {
  "index" : 1403,
  "chapter" : 37,
  "number" : 3,
  "asking" : " You are a solutions architect working for a media company that hosts its website on AWS. Currently, there is a single Amazon Elastic Compute Cloud (Amazon EC2) Instance on AWS with MySQL installed locally to that Amazon EC2 Instance. You have been asked to make the company’s production environment more resilient and to increase performance. You suggest that the company split out the MySQL database onto an Amazon RDS Instance with Multi-AZ enabled. This addresses the company’s increased resiliency requirements. Now you need to suggest how you can increase performance. Ninety-nine percent of the company’s end users are magazine subscribers who will be reading additional articles on the website, so only one percent of end users will need to write data to the site. What should you suggest to increase performance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Alter the connection string so that if a user is going to write data, it is written to the secondary copy of the Multi-AZ database."
  }, {
    "option" : "B",
    "description" : " Alter the connection string so that if a user is going to write data, it is written to the primary copy of the Multi-AZ database."
  }, {
    "option" : "C",
    "description" : " Recommend that the company use read replicas, and distribute the traffic across multiple read replicas."
  }, {
    "option" : "D",
    "description" : " Migrate the MySQL database to Amazon Redshift to take advantage of columnar storage and maximize performance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 3,
    "options" : [ "C" ],
    "description" : "In this scenario, the best idea is to use read replicas to scale out the database and thus maximize read performance. When using Multi-AZ, the secondary database is not accessible and all reads and writes must go to the primary or any read replicas."
  }
}, {
  "index" : 1404,
  "chapter" : 37,
  "number" : 4,
  "asking" : " Which AWS Cloud service is best suited for Online Analytics Processing (OLAP)?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Redshift"
  }, {
    "option" : "B",
    "description" : " Amazon Relational Database Service (Amazon RDS)"
  }, {
    "option" : "C",
    "description" : " Amazon Glacier"
  }, {
    "option" : "D",
    "description" : " Amazon DynamoDB"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "Amazon Redshift is best suited for traditional OLAP transactions. While Amazon RDS can also be used for OLAP, Amazon Redshift is purpose-built as an OLAP data warehouse."
  }
}, {
  "index" : 1405,
  "chapter" : 37,
  "number" : 5,
  "asking" : " You have been using Amazon Relational Database Service (Amazon RDS) for the last year to run an important application with automated backups enabled. One of your team members is performing routine maintenance and accidentally drops an important table, causing an outage. How can you recover the missing data while minimizing the duration of the outage?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Perform an undo operation and recover the table."
  }, {
    "option" : "B",
    "description" : " Restore the database from a recent automated DB snapshot."
  }, {
    "option" : "C",
    "description" : " Restore only the dropped table from the DB snapshot."
  }, {
    "option" : "D",
    "description" : " The data cannot be recovered."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 5,
    "options" : [ "B" ],
    "description" : "DB Snapshots can be used to restore a complete copy of the database at a specific point in time. Individual tables cannot be extracted from a snapshot."
  }
}, {
  "index" : 1406,
  "chapter" : 37,
  "number" : 6,
  "asking" : " Which Amazon Relational Database Service (Amazon RDS) database engines support Multi-AZ?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " All of them"
  }, {
    "option" : "B",
    "description" : " Microsoft SQL Server, MySQL, and Oracle"
  }, {
    "option" : "C",
    "description" : " Oracle, Amazon Aurora, and PostgreSQL"
  }, {
    "option" : "D",
    "description" : " MySQL"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 6,
    "options" : [ "A" ],
    "description" : "All Amazon RDS database engines support Multi-AZ deployment."
  }
}, {
  "index" : 1407,
  "chapter" : 37,
  "number" : 7,
  "asking" : " Which Amazon Relational Database Service (Amazon RDS) database engines support read replicas?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Microsoft SQL Server and Oracle"
  }, {
    "option" : "B",
    "description" : " MySQL, MariaDB, PostgreSQL, and Aurora"
  }, {
    "option" : "C",
    "description" : " Aurora, Microsoft SQL Server, and Oracle"
  }, {
    "option" : "D",
    "description" : " MySQL and PostgreSQL"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 7,
    "options" : [ "B" ],
    "description" : "Read replicas are supported by MySQL, MariaDB, PostgreSQL, and Aurora."
  }
}, {
  "index" : 1408,
  "chapter" : 37,
  "number" : 8,
  "asking" : " Your team is building an order processing system that will span multiple Availability Zones. During testing, the team wanted to test how the application will react to a database failover. How can you enable this type of test?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Force a Multi-AZ failover from one Availability Zone to another by rebooting the primary instance using the Amazon RDS console."
  }, {
    "option" : "B",
    "description" : " Terminate the DB instance, and create a new one. Update the connection string."
  }, {
    "option" : "C",
    "description" : " Create a support case asking for a failover."
  }, {
    "option" : "D",
    "description" : " It is not possible to test a failover."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 8,
    "options" : [ "A" ],
    "description" : "You can force a failover from one Availability Zone to another by rebooting the primary instance in the AWS Management Console. This is often how people test a failover in the real world. There is no need to create a support case."
  }
}, {
  "index" : 1409,
  "chapter" : 37,
  "number" : 9,
  "asking" : " You are a system administrator whose company has moved its production database to AWS. Your company monitors its estate using Amazon CloudWatch, which sends alarms using Amazon Simple Notification Service (Amazon SNS) to your mobile phone. One night, you get an alert that your primary Amazon Relational Database Service (Amazon RDS) Instance has gone down. You have Multi-AZ enabled on this instance. What should you do to ensure the failover happens quickly?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Update your Domain Name System (DNS) to point to the secondary instance’s new IP address, forcing your application to fail over to the secondary instance."
  }, {
    "option" : "B",
    "description" : " Connect to your server using Secure Shell (SSH) and update your connection strings so that your application can communicate to the secondary instance instead of the failed primary instance."
  }, {
    "option" : "C",
    "description" : " Take a snapshot of the secondary instance and create a new instance using this snapshot, then update your connection string to point to the new instance."
  }, {
    "option" : "D",
    "description" : " No action is necessary. Your connection string points to the database endpoint, and AWS automatically updates this endpoint to point to your secondary instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 9,
    "options" : [ "D" ],
    "description" : "Monitor the environment while Amazon RDS attempts to recover automatically. AWS will update the DB endpoint to point to the secondary instance automatically."
  }
}, {
  "index" : 1410,
  "chapter" : 37,
  "number" : 10,
  "asking" : " You are working for a small organization without a dedicated database administrator on staff. You need to install Microsoft SQL Server Enterprise edition quickly to support an accounting back office application on Amazon Relational Database Service (Amazon RDS). What should you do?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Launch an Amazon RDS DB Instance, and select Microsoft SQL Server Enterprise Edition under the Bring Your Own License (BYOL) model."
  }, {
    "option" : "B",
    "description" : " Provision SQL Server Enterprise Edition using the License Included option from the Amazon RDS Console."
  }, {
    "option" : "C",
    "description" : " SQL Server Enterprise edition is only available via the Command Line Interface (CLI). Install the command-line tools on your laptop, and then provision your new Amazon RDS Instance using the CLI."
  }, {
    "option" : "D",
    "description" : " You cannot use SQL Server Enterprise edition on Amazon RDS. You should install this on to a dedicated Amazon Elastic Compute Cloud (Amazon EC2) Instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 10,
    "options" : [ "A" ],
    "description" : "Amazon RDS supports Microsoft SQL Server Enterprise edition and the license is available only under the BYOL model."
  }
}, {
  "index" : 1411,
  "chapter" : 37,
  "number" : 11,
  "asking" : " You are building the database tier for an enterprise application that gets occasional activity throughout the day. Which storage type should you select as your default option?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Magnetic storage"
  }, {
    "option" : "B",
    "description" : " General Purpose Solid State Drive (SSD)"
  }, {
    "option" : "C",
    "description" : " Provisioned IOPS (SSD)"
  }, {
    "option" : "D",
    "description" : " Storage Area Network (SAN)-attached"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 11,
    "options" : [ "B" ],
    "description" : "General Purpose (SSD) volumes are generally the right choice for databases that have bursts of activity."
  }
}, {
  "index" : 1412,
  "chapter" : 37,
  "number" : 12,
  "asking" : " You are designing an e-commerce web application that will scale to potentially hundreds of thousands of concurrent users. Which database technology is best suited to hold the session state for large numbers of concurrent users?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Relational database using Amazon Relational Database Service (Amazon RDS)"
  }, {
    "option" : "B",
    "description" : " NoSQL database table using Amazon DynamoDB"
  }, {
    "option" : "C",
    "description" : " Data warehouse using Amazon Redshift"
  }, {
    "option" : "D",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 12,
    "options" : [ "B" ],
    "description" : "NoSQL databases like Amazon DynamoDB excel at scaling to hundreds of thousands of requests with key/value access to user profile and session."
  }
}, {
  "index" : 1413,
  "chapter" : 37,
  "number" : 13,
  "asking" : " Which of the following techniques can you use to help you meet Recovery Point Objective (RPO) and Recovery Time Objective (RTO) requirements? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " DB snapshots"
  }, {
    "option" : "B",
    "description" : " DB option groups"
  }, {
    "option" : "C",
    "description" : " Read replica"
  }, {
    "option" : "D",
    "description" : " Multi-AZ deployment"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 13,
    "options" : [ "A", "C", "D" ],
    "description" : "DB snapshots allow you to back up and recover your data, while read replicas and a Multi-AZ deployment allow you to replicate your data and reduce the time to failover."
  }
}, {
  "index" : 1414,
  "chapter" : 37,
  "number" : 14,
  "asking" : " When using Amazon Relational Database Service (Amazon RDS) Multi-AZ, how can you offload read requests from the primary? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Configure the connection string of the clients to connect to the secondary node and perform reads while the primary is used for writes."
  }, {
    "option" : "B",
    "description" : " Amazon RDS automatically sends writes to the primary and sends reads to the secondary."
  }, {
    "option" : "C",
    "description" : " Add a read replica DB instance, and configure the client’s application logic to use a read-replica."
  }, {
    "option" : "D",
    "description" : " Create a caching environment using ElastiCache to cache frequently used data. Update the application logic to read/write from the cache."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 14,
    "options" : [ "C", "D" ],
    "description" : "Amazon RDS allows for the creation of one or more read-replicas for many engines that can be used to handle reads. Another common pattern is to create a cache using Memcached and Amazon ElastiCache to store frequently used queries. The secondary slave DB Instance is not accessible and cannot be used to offload queries."
  }
}, {
  "index" : 1415,
  "chapter" : 37,
  "number" : 15,
  "asking" : " You are building a large order processing system and are responsible for securing the database. Which actions will you take to protect the data? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Adjust AWS Identity and Access Management (IAM) permissions for administrators."
  }, {
    "option" : "B",
    "description" : " Configure security groups and network Access Control Lists (ACLs) to limit network access."
  }, {
    "option" : "C",
    "description" : " Configure database users, and grant permissions to database objects."
  }, {
    "option" : "D",
    "description" : " Install anti-virus software on the Amazon RDS DB Instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 15,
    "options" : [ "A", "B", "C" ],
    "description" : "Protecting your database requires a multilayered approach that secures the infrastructure, the network, and the database itself. Amazon RDS is a managed service and direct access to the OS is not available."
  }
}, {
  "index" : 1416,
  "chapter" : 37,
  "number" : 16,
  "asking" : " Your team manages a popular website running Amazon Relational Database Service (Amazon RDS) MySQL back end. The Marketing department has just informed you about an upcoming television commercial that will drive thousands of new visitors to the website. How can you prepare your database to handle the load? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Vertically scale the DB Instance by selecting a more powerful instance class."
  }, {
    "option" : "B",
    "description" : " Create read replicas to offload read requests and update your application."
  }, {
    "option" : "C",
    "description" : " Upgrade the storage from Magnetic volumes to General Purpose Solid State Drive (SSD) volumes."
  }, {
    "option" : "D",
    "description" : " Upgrade to Amazon Redshift for faster columnar storage."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 16,
    "options" : [ "A", "B", "C" ],
    "description" : "Vertically scaling up is one of the simpler options that can give you additional processing power without making any architectural changes. Read replicas require some application changes but let you scale processing power horizontally. Finally, busy databases are often I/O- bound, so upgrading storage to General Purpose (SSD) or Provisioned IOPS (SSD) can often allow for additional request processing."
  }
}, {
  "index" : 1417,
  "chapter" : 37,
  "number" : 17,
  "asking" : " You are building a photo management application that maintains metadata on millions of images in an Amazon DynamoDB table. When a photo is retrieved, you want to display the metadata next to the image. Which Amazon DynamoDB operation will you use to retrieve the metadata attributes from the table?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Scan operation"
  }, {
    "option" : "B",
    "description" : " Search operation"
  }, {
    "option" : "C",
    "description" : " Query operation"
  }, {
    "option" : "D",
    "description" : " Find operation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 17,
    "options" : [ "C" ],
    "description" : "Query is the most efficient operation to find a single item in a large table."
  }
}, {
  "index" : 1418,
  "chapter" : 37,
  "number" : 18,
  "asking" : " You are creating an Amazon DynamoDB table that will contain messages for a social chat application. This table will have the following attributes: Username (String), Timestamp (Number), Message (String). Which attribute should you use as the partition key? The sort key?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Username, Timestamp"
  }, {
    "option" : "B",
    "description" : " Username, Message"
  }, {
    "option" : "C",
    "description" : " Timestamp, Message"
  }, {
    "option" : "D",
    "description" : " Message, Timestamp"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 18,
    "options" : [ "A" ],
    "description" : "Using the Username as a partition key will evenly spread your users across the partitions. Messages are often filtered down by time range, so Timestamp makes sense as a sort key."
  }
}, {
  "index" : 1419,
  "chapter" : 37,
  "number" : 19,
  "asking" : " Which of the following statements about Amazon DynamoDB tables are true? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Global secondary indexes can only be created when the table is being created."
  }, {
    "option" : "B",
    "description" : " Local secondary indexes can only be created when the table is being created."
  }, {
    "option" : "C",
    "description" : " You can only have one global secondary index."
  }, {
    "option" : "D",
    "description" : " You can only have one local secondary index."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 19,
    "options" : [ "B", "D" ],
    "description" : "You can only have a single local secondary index, and it must be created at the same time the table is created. You can create many global secondary indexes after the table has been created."
  }
}, {
  "index" : 1420,
  "chapter" : 37,
  "number" : 20,
  "asking" : " Which of the following workloads are a good fit for running on Amazon Redshift? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Transactional database supporting a busy e-commerce order processing website"
  }, {
    "option" : "B",
    "description" : " Reporting database supporting back-office analytics"
  }, {
    "option" : "C",
    "description" : " Data warehouse used to aggregate multiple disparate data sources"
  }, {
    "option" : "D",
    "description" : " Manage session state and user profile data for thousands of concurrent users"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 7,
    "number" : 20,
    "options" : [ "B", "C" ],
    "description" : "Amazon Redshift is an Online Analytical Processing (OLAP) data warehouse designed for analytics, Extract, Transform, Load (ETL), and high-speed querying. It is not well suited for running transactional applications that require high volumes of small inserts or updates."
  }
}, {
  "index" : 1421,
  "chapter" : 38,
  "number" : 1,
  "asking" : " Which of the following is not a supported Amazon Simple Notification Service (Amazon SNS) protocol?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " HTTPS"
  }, {
    "option" : "B",
    "description" : " AWS Lambda"
  }, {
    "option" : "C",
    "description" : " Email-JSON"
  }, {
    "option" : "D",
    "description" : " Amazon DynamoDB"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 1,
    "options" : [ "D" ],
    "description" : "Amazon DynamoDB is not a supported Amazon SNS protocol."
  }
}, {
  "index" : 1422,
  "chapter" : 38,
  "number" : 2,
  "asking" : " When you create a new Amazon Simple Notification Service (Amazon SNS) topic, which of the following is created automatically?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An Amazon Resource Name (ARN)"
  }, {
    "option" : "B",
    "description" : " A subscriber"
  }, {
    "option" : "C",
    "description" : " An Amazon Simple Queue Service (Amazon SQS) queue to deliver your Amazon SNS topic"
  }, {
    "option" : "D",
    "description" : " A message"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 2,
    "options" : [ "A" ],
    "description" : "When you create a new Amazon SNS topic, an Amazon ARN is created automatically."
  }
}, {
  "index" : 1423,
  "chapter" : 38,
  "number" : 3,
  "asking" : " Which of the following are features of Amazon Simple Notification Service (Amazon SNS)? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Publishers"
  }, {
    "option" : "B",
    "description" : " Readers"
  }, {
    "option" : "C",
    "description" : " Subscribers"
  }, {
    "option" : "D",
    "description" : " Topic"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 3,
    "options" : [ "A", "C", "D" ],
    "description" : "Publishers, subscribers, and topics are the correct answers. You have subscribers to an Amazon SNS topic, not readers."
  }
}, {
  "index" : 1424,
  "chapter" : 38,
  "number" : 4,
  "asking" : " What is the default time for an Amazon Simple Queue Service (Amazon SQS) visibility timeout?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 30 seconds"
  }, {
    "option" : "B",
    "description" : " 60 seconds"
  }, {
    "option" : "C",
    "description" : " 1 hour"
  }, {
    "option" : "D",
    "description" : " 12 hours"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "The default time for an Amazon SQS visibility timeout is 30 seconds."
  }
}, {
  "index" : 1425,
  "chapter" : 38,
  "number" : 5,
  "asking" : " What is the longest time available for an Amazon Simple Queue Service (Amazon SQS) visibility timeout?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 30 seconds"
  }, {
    "option" : "B",
    "description" : " 60 seconds"
  }, {
    "option" : "C",
    "description" : " 1 hour"
  }, {
    "option" : "D",
    "description" : " 12 hours"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 5,
    "options" : [ "D" ],
    "description" : "The maximum time for an Amazon SQS visibility timeout is 12 hours."
  }
}, {
  "index" : 1426,
  "chapter" : 38,
  "number" : 6,
  "asking" : " Which of the following options are valid properties of an Amazon Simple Queue Service (Amazon SQS) message? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Destination"
  }, {
    "option" : "B",
    "description" : " Message ID"
  }, {
    "option" : "C",
    "description" : " Type"
  }, {
    "option" : "D",
    "description" : " Body"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 6,
    "options" : [ "B", "D" ],
    "description" : "The valid properties of an SQS message are Message ID and Body. Each message receives a system-assigned Message ID that Amazon SQS returns to you in the SendMessage response. The Message Body is composed of name/value pairs and the unstructured, uninterpreted content."
  }
}, {
  "index" : 1427,
  "chapter" : 38,
  "number" : 7,
  "asking" : " You are a solutions architect who is working for a mobile application company that wants to use Amazon Simple Workflow Service (Amazon SWF) for their new takeout ordering application. They will have multiple workflows that will need to interact. What should you advise them to do in structuring the design of their Amazon SWF environment?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use multiple domains, each containing a single workflow, and design the workflows to interact across the different domains."
  }, {
    "option" : "B",
    "description" : " Use a single domain containing multiple workflows. In this manner, the workflows will be able to interact."
  }, {
    "option" : "C",
    "description" : " Use a single domain with a single workflow and collapse all activities to within this single workflow."
  }, {
    "option" : "D",
    "description" : " Workflows cannot interact with each other; they would be better off using Amazon Simple Queue Service (Amazon SQS) and Amazon Simple Notification Service (Amazon SNS) for their application."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 7,
    "options" : [ "B" ],
    "description" : "Use a single domain with multiple workflows. Workflows within separate domains cannot interact."
  }
}, {
  "index" : 1428,
  "chapter" : 38,
  "number" : 8,
  "asking" : " In Amazon Simple Workflow Service (Amazon SWF), which of the following are actors? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Activity workers"
  }, {
    "option" : "B",
    "description" : " Workflow starters"
  }, {
    "option" : "C",
    "description" : " Deciders"
  }, {
    "option" : "D",
    "description" : " Activity tasks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 8,
    "options" : [ "A", "B", "C" ],
    "description" : "In Amazon SWF, actors can be activity workers, workflow starters, or deciders."
  }
}, {
  "index" : 1429,
  "chapter" : 38,
  "number" : 9,
  "asking" : " You are designing a new application, and you need to ensure that the components of your application are not tightly coupled. You are trying to decide between the different AWS Cloud services to use to achieve this goal. Your requirements are that messages between your application components may not be delivered more than once, tasks must be completed in either a synchronous or asynchronous fashion, and there must be some form of application logic that decides what do when tasks have been completed. What application service should you use?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Simple Queue Service (Amazon SQS)"
  }, {
    "option" : "B",
    "description" : " Amazon Simple Workflow Service (Amazon SWF)"
  }, {
    "option" : "C",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  }, {
    "option" : "D",
    "description" : " Amazon Simple Email Service (Amazon SES)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 9,
    "options" : [ "B" ],
    "description" : "Amazon SWF would best serve your purpose in this scenario because it helps developers build, run, and scale background jobs that have parallel or sequential steps. You can think of Amazon SWF as a fully-managed state tracker and task coordinator in the Cloud."
  }
}, {
  "index" : 1430,
  "chapter" : 38,
  "number" : 10,
  "asking" : " How does Amazon Simple Queue Service (Amazon SQS) deliver messages?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Last In, First Out (LIFO)"
  }, {
    "option" : "B",
    "description" : " First In, First Out (FIFO)"
  }, {
    "option" : "C",
    "description" : " Sequentially"
  }, {
    "option" : "D",
    "description" : " Amazon SQS doesn’t guarantee delivery of your messages in any particular order."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 10,
    "options" : [ "D" ],
    "description" : "Amazon SQS does not guarantee in what order your messages will be delivered."
  }
}, {
  "index" : 1431,
  "chapter" : 38,
  "number" : 11,
  "asking" : " Of the following options, what is an efficient way to fanout a single Amazon Simple Notification Service (Amazon SNS) message to multiple Amazon Simple Queue Service (Amazon SQS) queues?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create an Amazon SNS topic using Amazon SNS. Then create and subscribe multiple Amazon SQS queues sent to the Amazon SNS topic."
  }, {
    "option" : "B",
    "description" : " Create one Amazon SQS queue that subscribes to multiple Amazon SNS topics."
  }, {
    "option" : "C",
    "description" : " Amazon SNS allows exactly one subscriber to each topic, so fanout is not possible."
  }, {
    "option" : "D",
    "description" : " Create an Amazon SNS topic using Amazon SNS. Create an application that subscribes to that topic and duplicates the message. Send copies to multiple Amazon SQS queues."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 11,
    "options" : [ "A" ],
    "description" : "Multiple queues can subscribe to an Amazon SNS topic, which can enable parallel asynchronous processing."
  }
}, {
  "index" : 1432,
  "chapter" : 38,
  "number" : 12,
  "asking" : " Your application polls an Amazon Simple Queue Service (Amazon SQS) queue frequently and returns immediately, often with empty ReceiveMessageResponses. What is one thing that can be done to reduce Amazon SQS costs?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Pricing on Amazon SQS does not include a cost for service requests; therefore, there is no concern."
  }, {
    "option" : "B",
    "description" : " Increase the timeout value for short polling to wait for messages longer before returning a response."
  }, {
    "option" : "C",
    "description" : " Change the message visibility value to a higher number."
  }, {
    "option" : "D",
    "description" : " Use long polling by supplying a WaitTimeSeconds of greater than 0 seconds when calling ReceiveMessage."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 12,
    "options" : [ "D" ],
    "description" : "Long polling allows your application to poll the queue, and, if nothing is there, Amazon Elastic Compute Cloud (Amazon EC2) waits for an amount of time you specify (between 1 and 20 seconds). If a message arrives in that time, it is delivered to your application as soon as possible. If a message does not arrive in that time, you need to execute the ReceiveMessage function again."
  }
}, {
  "index" : 1433,
  "chapter" : 38,
  "number" : 13,
  "asking" : " What is the longest time available for an Amazon Simple Queue Service (Amazon SQS) long polling timeout?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 10 seconds"
  }, {
    "option" : "B",
    "description" : " 20 seconds"
  }, {
    "option" : "C",
    "description" : " 30 seconds"
  }, {
    "option" : "D",
    "description" : " 1 hour"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 13,
    "options" : [ "B" ],
    "description" : "The maximum time for an Amazon SQS long polling timeout is 20 seconds."
  }
}, {
  "index" : 1434,
  "chapter" : 38,
  "number" : 14,
  "asking" : " What is the longest configurable message retention period for Amazon Simple Queue Service (Amazon SQS)?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 30 minutes"
  }, {
    "option" : "B",
    "description" : " 4 days"
  }, {
    "option" : "C",
    "description" : " 30 seconds"
  }, {
    "option" : "D",
    "description" : " 14 days"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 14,
    "options" : [ "D" ],
    "description" : "The longest configurable message retention period for Amazon SQS is 14 days."
  }
}, {
  "index" : 1435,
  "chapter" : 38,
  "number" : 15,
  "asking" : " What is the default message retention period for Amazon Simple Queue Service (Amazon SQS)?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 30 minutes"
  }, {
    "option" : "B",
    "description" : " 4 days"
  }, {
    "option" : "C",
    "description" : " 30 seconds"
  }, {
    "option" : "D",
    "description" : " 14 days"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 15,
    "options" : [ "B" ],
    "description" : "The default message retention period that can be set in Amazon SQS is four days."
  }
}, {
  "index" : 1436,
  "chapter" : 38,
  "number" : 16,
  "asking" : " Amazon Simple Notification Service (Amazon SNS) is a push notification service that lets you send individual or multiple messages to large numbers of recipients. What types of clients are supported?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Java and JavaScript clients that support publisher and subscriber types"
  }, {
    "option" : "B",
    "description" : " Producers and consumers supported by C and C++ clients"
  }, {
    "option" : "C",
    "description" : " Mobile and AMQP support for publisher and subscriber client types"
  }, {
    "option" : "D",
    "description" : " Publisher and subscriber client types"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 16,
    "options" : [ "D" ],
    "description" : "With Amazon SNS, you send individual or multiple messages to large numbers of recipients using publisher and subscriber client types."
  }
}, {
  "index" : 1437,
  "chapter" : 38,
  "number" : 17,
  "asking" : " In Amazon Simple Workflow Service (Amazon SWF), a decider is responsible for what?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Executing each step of the work"
  }, {
    "option" : "B",
    "description" : " Defining work coordination logic by specifying work sequencing, timing, and failure conditions"
  }, {
    "option" : "C",
    "description" : " Executing your workflow"
  }, {
    "option" : "D",
    "description" : " Registering activities and workflow with Amazon SWF"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 17,
    "options" : [ "B" ],
    "description" : "The decider schedules the activity tasks and provides input data to the activity workers. The decider also processes events that arrive while the workflow is in progress and closes the workflow when the objective has been completed."
  }
}, {
  "index" : 1438,
  "chapter" : 38,
  "number" : 18,
  "asking" : " Can an Amazon Simple Notification Service (Amazon SNS) topic be recreated with a previously used topic name?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Yes. The topic name should typically be available after 24 hours after the previous topic with the same name has been deleted."
  }, {
    "option" : "B",
    "description" : " Yes. The topic name should typically be available after 1–3 hours after the previous topic with the same name has been deleted."
  }, {
    "option" : "C",
    "description" : " Yes. The topic name should typically be available after 30–60 seconds after the previous topic with the same name has been deleted."
  }, {
    "option" : "D",
    "description" : " At this time, this feature is not supported."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 18,
    "options" : [ "C" ],
    "description" : "Topic names should typically be available for reuse approximately 30–60 seconds after the previous topic with the same name has been deleted. The exact time will depend on the number of subscriptions active on the topic; topics with a few subscribers will be available instantly for reuse, while topics with larger subscriber lists may take longer."
  }
}, {
  "index" : 1439,
  "chapter" : 38,
  "number" : 19,
  "asking" : " What should you do in order to grant a different AWS account permission to your Amazon Simple Queue Service (Amazon SQS) queue?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Share credentials to your AWS account and have the other account’s applications use your account’s credentials to access the Amazon SQS queue."
  }, {
    "option" : "B",
    "description" : " Create a user for that account in AWS Identity and Access Management (IAM) and establish an IAM policy that grants access to the queue."
  }, {
    "option" : "C",
    "description" : " Create an Amazon SQS policy that grants the other account access."
  }, {
    "option" : "D",
    "description" : " Amazon Virtual Private Cloud (Amazon VPC) peering must be used to achieve this."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 19,
    "options" : [ "C" ],
    "description" : "The main difference between Amazon SQS policies and IAM policies is that an Amazon SQS policy enables you to grant a different AWS account permission to your Amazon SQS queues, but an IAM policy does not."
  }
}, {
  "index" : 1440,
  "chapter" : 38,
  "number" : 20,
  "asking" : " Can an Amazon Simple Notification Service (Amazon SNS) message be deleted after being published to a topic?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Only if a subscriber(s) has/have not read the message yet"
  }, {
    "option" : "B",
    "description" : " Only if the Amazon SNS recall message parameter has been set"
  }, {
    "option" : "C",
    "description" : " No. After a message has been successfully published to a topic, it cannot be recalled."
  }, {
    "option" : "D",
    "description" : " Yes. However it can be deleted only if the subscribers are Amazon SQS queues."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 8,
    "number" : 20,
    "options" : [ "C" ],
    "description" : "No. After a message has been successfully published to a topic, it cannot be recalled."
  }
}, {
  "index" : 1441,
  "chapter" : 39,
  "number" : 1,
  "asking" : " Public hosted zone",
  "answerOption" : [ ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 1,
    "options" : [ "C" ],
    "description" : "An AAAA record is used to route traffic to an IPv6 address, whereas an A record is used to route traffic to an IPv4 address."
  }
}, {
  "index" : 1442,
  "chapter" : 39,
  "number" : 2,
  "asking" : " Global hosted zone",
  "answerOption" : [ ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 2,
    "options" : [ "B" ],
    "description" : "Domain names are registered with a domain registrar, which then registers the name to InterNIC."
  }
}, {
  "index" : 1443,
  "chapter" : 39,
  "number" : 3,
  "asking" : " Private hosted zone",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1 and 2"
  }, {
    "option" : "B",
    "description" : " 1 and 3"
  }, {
    "option" : "C",
    "description" : " 2 and 3"
  }, {
    "option" : "D",
    "description" : " 1, 2, and 3"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 3,
    "options" : [ "C" ],
    "description" : "You should route your traffic based on where your end users are located. The best routing policy to achieve this is geolocation routing."
  }
}, {
  "index" : 1444,
  "chapter" : 39,
  "number" : 4,
  "asking" : " Which type of DNS record should you use to resolve an IP address to a domain name?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An A record"
  }, {
    "option" : "B",
    "description" : " A C Name"
  }, {
    "option" : "C",
    "description" : " An SPF record"
  }, {
    "option" : "D",
    "description" : " A PTR record"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 4,
    "options" : [ "D" ],
    "description" : "A PTR record is used to resolve an IP address to a domain name, and it is commonly referred to as “reverse DNS.”"
  }
}, {
  "index" : 1445,
  "chapter" : 39,
  "number" : 5,
  "asking" : " You host a web application across multiple AWS regions in the world, and you need to configure your DNS so that your end users will get the fastest network performance possible. Which routing policy should you apply?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Geolocation routing"
  }, {
    "option" : "B",
    "description" : " Latency-based routing"
  }, {
    "option" : "C",
    "description" : " Simple routing"
  }, {
    "option" : "D",
    "description" : " Weighted routing"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 5,
    "options" : [ "B" ],
    "description" : "You want your users to have the fastest network access possible. To do this, you would use latency-based routing. Geolocation routing would not achieve this as well as latency- based routing, which is specifically geared toward measuring the latency and thus would direct you to the AWS region in which you would have the lowest latency."
  }
}, {
  "index" : 1446,
  "chapter" : 39,
  "number" : 6,
  "asking" : " Which DNS record should you use to configure the transmission of email to your intended mail server?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " SPF records"
  }, {
    "option" : "B",
    "description" : " A records"
  }, {
    "option" : "C",
    "description" : " MX records"
  }, {
    "option" : "D",
    "description" : " SOA record"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 6,
    "options" : [ "C" ],
    "description" : "You would use Mail eXchange (MX) records to define which inbound destination mail server should be used."
  }
}, {
  "index" : 1447,
  "chapter" : 39,
  "number" : 7,
  "asking" : " Which DNS records are commonly used to stop email spoofing and spam?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " MX records"
  }, {
    "option" : "B",
    "description" : " SPF records"
  }, {
    "option" : "C",
    "description" : " A records"
  }, {
    "option" : "D",
    "description" : " C names"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 7,
    "options" : [ "B" ],
    "description" : "SPF records are used to verify authorized senders of mail from your domain."
  }
}, {
  "index" : 1448,
  "chapter" : 39,
  "number" : 8,
  "asking" : " You are rolling out A and B test versions of a web application to see which version results in the most sales. You need 10 percent of your traffic to go to version A, 10 percent to go to version B, and the rest to go to your current production version. Which routing policy should you choose to achieve this?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Simple routing"
  }, {
    "option" : "B",
    "description" : " Weighted routing"
  }, {
    "option" : "C",
    "description" : " Geolocation routing"
  }, {
    "option" : "D",
    "description" : " Failover routing"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 8,
    "options" : [ "B" ],
    "description" : "Weighted routing would best achieve this objective because it allows you to specify which percentage of traffic is directed to each endpoint."
  }
}, {
  "index" : 1449,
  "chapter" : 39,
  "number" : 9,
  "asking" : " Which DNS record must all zones have by default?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " SPF"
  }, {
    "option" : "B",
    "description" : " TXT"
  }, {
    "option" : "C",
    "description" : " MX"
  }, {
    "option" : "D",
    "description" : " SOA"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 9,
    "options" : [ "D" ],
    "description" : "The start of a zone is defined by the SOA; therefore, all zones must have an SOA record by default."
  }
}, {
  "index" : 1450,
  "chapter" : 39,
  "number" : 10,
  "asking" : " Your company has its primary production site in Western Europe and its DR site in the Asia Pacific. You need to configure DNS so that if your primary site becomes unavailable, you can fail DNS over to the secondary site. Which DNS routing policy would best achieve this?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Weighted routing"
  }, {
    "option" : "B",
    "description" : " Geolocation routing"
  }, {
    "option" : "C",
    "description" : " Simple routing"
  }, {
    "option" : "D",
    "description" : " Failover routing"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 10,
    "options" : [ "D" ],
    "description" : "Failover-based routing would best achieve this objective."
  }
}, {
  "index" : 1451,
  "chapter" : 39,
  "number" : 11,
  "asking" : " Which type of DNS record should you use to resolve a domain name to another domain name?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An A record"
  }, {
    "option" : "B",
    "description" : " A CNAME record"
  }, {
    "option" : "C",
    "description" : " An SPF record"
  }, {
    "option" : "D",
    "description" : " A PTR record"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 11,
    "options" : [ "B" ],
    "description" : "The CNAME record maps a name to another name. It should be used only when there are no other records on that name."
  }
}, {
  "index" : 1452,
  "chapter" : 39,
  "number" : 12,
  "asking" : " Which is a function that Amazon Route 53 does not perform?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Domain registration"
  }, {
    "option" : "B",
    "description" : " DNS service"
  }, {
    "option" : "C",
    "description" : " Load balancing"
  }, {
    "option" : "D",
    "description" : " Health checks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 12,
    "options" : [ "C" ],
    "description" : "Amazon Route 53 performs three main functions: domain registration, DNS service, and health checking."
  }
}, {
  "index" : 1453,
  "chapter" : 39,
  "number" : 13,
  "asking" : " Which DNS record can be used to store human-readable information about a server, network, and other accounting data with a host?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A TXT record"
  }, {
    "option" : "B",
    "description" : " An MX record"
  }, {
    "option" : "C",
    "description" : " An SPF record"
  }, {
    "option" : "D",
    "description" : " A PTR record"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 13,
    "options" : [ "A" ],
    "description" : "A TXT record is used to store arbitrary and unformatted text with a host."
  }
}, {
  "index" : 1454,
  "chapter" : 39,
  "number" : 14,
  "asking" : " Which resource record set would not be allowed for the hosted zone example.com?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " www.example.com"
  }, {
    "option" : "B",
    "description" : " www.aws.example.com"
  }, {
    "option" : "C",
    "description" : " www.example.ca"
  }, {
    "option" : "D",
    "description" : " www.beta.example.com"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 14,
    "options" : [ "C" ],
    "description" : "The resource record sets contained in a hosted zone must share the same suffix."
  }
}, {
  "index" : 1455,
  "chapter" : 39,
  "number" : 15,
  "asking" : " Which port number is used to serve requests by DNS?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 22"
  }, {
    "option" : "B",
    "description" : " 53"
  }, {
    "option" : "C",
    "description" : " 161"
  }, {
    "option" : "D",
    "description" : " 389"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 15,
    "options" : [ "B" ],
    "description" : "DNS uses port number 53 to serve requests."
  }
}, {
  "index" : 1456,
  "chapter" : 39,
  "number" : 16,
  "asking" : " Which protocol is primarily used by DNS to serve requests?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Transmission Control Protocol (TCP)"
  }, {
    "option" : "B",
    "description" : " Hyper Text Transfer Protocol (HTTP)"
  }, {
    "option" : "C",
    "description" : " File Transfer Protocol (FTP)"
  }, {
    "option" : "D",
    "description" : " User Datagram Protocol (UDP)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 16,
    "options" : [ "D" ],
    "description" : "DNS primarily uses UDP to serve requests."
  }
}, {
  "index" : 1457,
  "chapter" : 39,
  "number" : 17,
  "asking" : " Which protocol is used by DNS when response data size exceeds 512 bytes?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Transmission Control Protocol (TCP)"
  }, {
    "option" : "B",
    "description" : " Hyper Text Transfer Protocol (HTTP)"
  }, {
    "option" : "C",
    "description" : " File Transfer Protocol (FTP)"
  }, {
    "option" : "D",
    "description" : " User Datagram Protocol (UDP)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 17,
    "options" : [ "A" ],
    "description" : "The TCP protocol is used by DNS server when the response data size exceeds 512 bytes or for tasks such as zone transfers."
  }
}, {
  "index" : 1458,
  "chapter" : 39,
  "number" : 18,
  "asking" : " What are the different hosted zones that can be created in Amazon Route 53?",
  "answerOption" : [ ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 18,
    "options" : [ "B" ],
    "description" : "Using Amazon Route 53, you can create two types of hosted zones: public hosted zones and private hosted zones."
  }
}, {
  "index" : 1459,
  "chapter" : 39,
  "number" : 19,
  "asking" : " Amazon Route 53 cannot route queries to which AWS resource?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon CloudFront distribution"
  }, {
    "option" : "B",
    "description" : " Elastic Load Balancing load balancer"
  }, {
    "option" : "C",
    "description" : " Amazon EC2"
  }, {
    "option" : "D",
    "description" : " AWS OpsWorks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 19,
    "options" : [ "D" ],
    "description" : "Amazon Route 53 can route queries to a variety of AWS resources such as an Amazon CloudFront distribution, an Elastic Load Balancing load balancer, an Amazon EC2 instance, a website hosted in an Amazon S3 bucket, and an Amazon Relational Database (Amazon RDS)."
  }
}, {
  "index" : 1460,
  "chapter" : 39,
  "number" : 20,
  "asking" : " When configuring Amazon Route 53 as your DNS service for an existing domain, which is the first step that needs to be performed?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create hosted zones."
  }, {
    "option" : "B",
    "description" : " Create resource record sets."
  }, {
    "option" : "C",
    "description" : " Register a domain with Amazon Route 53."
  }, {
    "option" : "D",
    "description" : " Transfer domain registration from current registrar to Amazon Route 53."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 9,
    "number" : 20,
    "options" : [ "D" ],
    "description" : "You must first transfer the existing domain registration from another registrar to Amazon Route 53 to configure it as your DNS service."
  }
}, {
  "index" : 1461,
  "chapter" : 40,
  "number" : 1,
  "asking" : " Which of the following objects are good candidates to store in a cache? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Session state"
  }, {
    "option" : "B",
    "description" : " Shopping cart"
  }, {
    "option" : "C",
    "description" : " Product catalog"
  }, {
    "option" : "D",
    "description" : " Bank account balance"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 1,
    "options" : [ "A", "B", "C" ],
    "description" : "Many types of objects are good candidates to cache because they have the potential to be accessed by numerous users repeatedly. Even the balance of a bank account could be cached for short periods of time if the back-end database query is slow to respond."
  }
}, {
  "index" : 1462,
  "chapter" : 40,
  "number" : 2,
  "asking" : " Which of the following cache engines are supported by Amazon ElastiCache? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " MySQL"
  }, {
    "option" : "B",
    "description" : " Memcached"
  }, {
    "option" : "C",
    "description" : " Redis"
  }, {
    "option" : "D",
    "description" : " Couchbase"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 2,
    "options" : [ "B", "C" ],
    "description" : "Amazon ElastiCache supports Memcached and Redis cache engines. MySQL is not a cache engine, and Couchbase is not supported."
  }
}, {
  "index" : 1463,
  "chapter" : 40,
  "number" : 3,
  "asking" : " How many nodes can you add to an Amazon ElastiCache cluster running Memcached?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1"
  }, {
    "option" : "B",
    "description" : " 5"
  }, {
    "option" : "C",
    "description" : " 20"
  }, {
    "option" : "D",
    "description" : " 100"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 3,
    "options" : [ "C" ],
    "description" : "The default limit is 20 nodes per cluster."
  }
}, {
  "index" : 1464,
  "chapter" : 40,
  "number" : 4,
  "asking" : " How many nodes can you add to an Amazon ElastiCache cluster running Redis?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 1"
  }, {
    "option" : "B",
    "description" : " 5"
  }, {
    "option" : "C",
    "description" : " 20"
  }, {
    "option" : "D",
    "description" : " 100"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "Redis clusters can only contain a single node; however, you can group multiple clusters together into a replication group."
  }
}, {
  "index" : 1465,
  "chapter" : 40,
  "number" : 5,
  "asking" : " An application currently uses Memcached to cache frequently used database queries. Which steps are required to migrate the application to use Amazon ElastiCache with minimal changes? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Recompile the application to use the Amazon ElastiCache libraries."
  }, {
    "option" : "B",
    "description" : " Update the configuration file with the endpoint for the Amazon ElastiCache cluster."
  }, {
    "option" : "C",
    "description" : " Configure a security group to allow access from the application servers."
  }, {
    "option" : "D",
    "description" : " Connect to the Amazon ElastiCache nodes using Secure Shell (SSH) and install the latest version of Memcached."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 5,
    "options" : [ "B", "C" ],
    "description" : "Amazon ElastiCache is Application Programming Interface (API)-compatible with existing Memcached clients and does not require the application to be recompiled or linked against the libraries. Amazon ElastiCache manages the deployment of the Amazon ElastiCache binaries."
  }
}, {
  "index" : 1466,
  "chapter" : 40,
  "number" : 6,
  "asking" : " How can you back up data stored in Amazon ElastiCache running Redis? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create an image of the Amazon Elastic Compute Cloud (Amazon EC2) instance."
  }, {
    "option" : "B",
    "description" : " Configure automatic snapshots to back up the cache environment every night."
  }, {
    "option" : "C",
    "description" : " Create a snapshot manually."
  }, {
    "option" : "D",
    "description" : " Redis clusters cannot be backed up."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 6,
    "options" : [ "B", "C" ],
    "description" : "Amazon ElastiCache with the Redis engine allows for both manual and automatic snapshots. Memcached does not have a backup function."
  }
}, {
  "index" : 1467,
  "chapter" : 40,
  "number" : 7,
  "asking" : " How can you secure an Amazon ElastiCache cluster? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Change the Memcached root password."
  }, {
    "option" : "B",
    "description" : " Restrict Application Programming Interface (API) actions using AWS Identity and Access Management (IAM) policies."
  }, {
    "option" : "C",
    "description" : " Restrict network access using security groups."
  }, {
    "option" : "D",
    "description" : " Restrict network access using a network Access Control List (ACL)."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 7,
    "options" : [ "B", "C", "D" ],
    "description" : "Limit access at the network level using security groups or network ACLs, and limit infrastructure changes using IAM."
  }
}, {
  "index" : 1468,
  "chapter" : 40,
  "number" : 8,
  "asking" : " You are working on a mobile gaming application and are building the leaderboard feature to track the top scores across millions of users. Which AWS services are best suited for this use case?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Redshift"
  }, {
    "option" : "B",
    "description" : " Amazon ElastiCache using Memcached"
  }, {
    "option" : "C",
    "description" : " Amazon ElastiCache using Redis"
  }, {
    "option" : "D",
    "description" : " Amazon Simple Storage Service (S3)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 8,
    "options" : [ "C" ],
    "description" : "Amazon ElastiCache with Redis provides native functions that simplify the development of leaderboards. With Memcached, it is more difficult to sort and rank large datasets. Amazon Redshift and Amazon S3 are not designed for high volumes of small reads and writes, typical of a mobile game."
  }
}, {
  "index" : 1469,
  "chapter" : 40,
  "number" : 9,
  "asking" : " You have built a large web application that uses Amazon ElastiCache using Memcached to store frequent query results. You plan to expand both the web fleet and the cache fleet multiple times over the next year to accommodate increased user traffic. How do you minimize the amount of changes required when a scaling event occurs?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Configure AutoDiscovery on the client side"
  }, {
    "option" : "B",
    "description" : " Configure AutoDiscovery on the server side"
  }, {
    "option" : "C",
    "description" : " Update the configuration file each time a new cluster"
  }, {
    "option" : "D",
    "description" : " Use an Elastic Load Balancer to proxy the requests"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 9,
    "options" : [ "A" ],
    "description" : "When the clients are configured to use AutoDiscovery, they can discover new cache nodes as they are added or removed. AutoDiscovery must be configured on each client and is not active server side. Updating the configuration file each time will be very difficult to manage. Using an Elastic Load Balancer is not recommended for this scenario."
  }
}, {
  "index" : 1470,
  "chapter" : 40,
  "number" : 10,
  "asking" : " Which cache engines does Amazon ElastiCache support? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Memcached"
  }, {
    "option" : "B",
    "description" : " Redis"
  }, {
    "option" : "C",
    "description" : " Membase"
  }, {
    "option" : "D",
    "description" : " Couchbase"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 10,
    "number" : 10,
    "options" : [ "A", "B" ],
    "description" : "Amazon ElastiCache supports both Memcached and Redis. You can run self- managed installations of Membase and Couchbase using Amazon Elastic Compute Cloud (Amazon EC2)."
  }
}, {
  "index" : 1471,
  "chapter" : 41,
  "number" : 1,
  "asking" : " What origin servers are supported by Amazon CloudFront? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " An Amazon Route 53 Hosted Zone"
  }, {
    "option" : "B",
    "description" : " An Amazon Simple Storage Service (Amazon S3) bucket"
  }, {
    "option" : "C",
    "description" : " An HTTP server running on Amazon Elastic Compute Cloud (Amazon EC2)"
  }, {
    "option" : "D",
    "description" : " An Amazon EC2 Auto Scaling Group"
  }, {
    "option" : "E",
    "description" : " An HTTP server running on-premises"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 1,
    "options" : [ "B", "C", "E" ],
    "description" : "Amazon CloudFront can use an Amazon S3 bucket or any HTTP server, whether or not it is running in Amazon EC2. A Route 53 Hosted Zone is a set of DNS resource records, while an Auto Scaling Group launches or terminates Amazon EC2 instances automatically. Neither can be specified as an origin server for a distribution."
  }
}, {
  "index" : 1472,
  "chapter" : 41,
  "number" : 2,
  "asking" : " Which of the following are good use cases for Amazon CloudFront? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " A popular software download site that supports users around the world, with dynamic content that changes rapidly"
  }, {
    "option" : "B",
    "description" : " A corporate website that serves training videos to employees. Most employees are located in two corporate campuses in the same city."
  }, {
    "option" : "C",
    "description" : " A heavily used video and music streaming service that requires content to be delivered only to paid subscribers"
  }, {
    "option" : "D",
    "description" : " A corporate HR website that supports a global workforce. Because the site contains sensitive data, all users must connect through a corporate Virtual Private Network (VPN)."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 2,
    "options" : [ "A", "C" ],
    "description" : "The site in A is “popular” and supports “users around the world,” key indicators that CloudFront is appropriate. Similarly, the site in C is “heavily used,” and requires private content, which is supported by Amazon CloudFront. Both B and D are corporate use cases where the requests come from a single geographic location or appear to come from one (because of the VPN). These use cases will generally not see benefit from Amazon CloudFront."
  }
}, {
  "index" : 1473,
  "chapter" : 41,
  "number" : 3,
  "asking" : " You have a web application that contains both static content in an Amazon Simple Storage Service (Amazon S3) bucket—primarily images and CSS files—and also dynamic content currently served by a PHP web app running on Amazon Elastic Compute Cloud (Amazon EC2). What features of Amazon CloudFront can be used to support this application with a single Amazon CloudFront distribution?",
  "answerOption" : [ ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 3,
    "options" : [ "C", "E" ],
    "description" : "Using multiple origins and setting multiple cache behaviors allow you to serve static and dynamic content from the same distribution. Origin Access Identifiers and signed URLs support serving private content from Amazon CloudFront, while multiple edge locations are simply how Amazon CloudFront serves any content."
  }
}, {
  "index" : 1474,
  "chapter" : 41,
  "number" : 4,
  "asking" : " (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Multiple Origin Access Identifiers"
  }, {
    "option" : "B",
    "description" : " Multiple signed URLs"
  }, {
    "option" : "C",
    "description" : " Multiple origins"
  }, {
    "option" : "D",
    "description" : " Multiple edge locations"
  }, {
    "option" : "E",
    "description" : " Multiple cache behaviors"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 4,
    "options" : [ "B" ],
    "description" : "Amazon CloudFront OAI is a special identity that can be used to restrict access to an Amazon S3 bucket only to an Amazon CloudFront distribution. Signed URLs, signed cookies, and IAM bucket policies can help to protect content served through Amazon CloudFront, but OAIs are the simplest way to ensure that only Amazon CloudFront has access to a bucket."
  }
}, {
  "index" : 1475,
  "chapter" : 41,
  "number" : 5,
  "asking" : " You are building a media-sharing web application that serves video files to end users on both PCs and mobile devices. The media files are stored as objects in an Amazon Simple Storage Service (Amazon S3) bucket, but are to be delivered through Amazon CloudFront. What is the simplest way to ensure that only Amazon CloudFront has access to the objects in the Amazon S3 bucket?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create Signed URLs for each Amazon S3 object."
  }, {
    "option" : "B",
    "description" : " Use an Amazon CloudFront Origin Access Identifier (OAI)."
  }, {
    "option" : "C",
    "description" : " Use public and private keys with signed cookies."
  }, {
    "option" : "D",
    "description" : " Use an AWS Identity and Access Management (IAM) bucket policy."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 5,
    "options" : [ "C" ],
    "description" : "AWS Storage Gateway allows you to access data in Amazon S3 locally, with the Gateway-Cached volume configuration allowing you to expand a relatively small amount of local storage into Amazon S3."
  }
}, {
  "index" : 1476,
  "chapter" : 41,
  "number" : 6,
  "asking" : " Your company data center is completely full, but the sales group has determined a need to store 200TB of product video. The videos were created over the last several years, with the most recent being accessed by sales the most often. The data must be accessed locally, but there is no space in the data center to install local storage devices to store this data. What AWS cloud service will meet sales’ requirements?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Storage Gateway Gateway-Stored volumes"
  }, {
    "option" : "B",
    "description" : " Amazon Elastic Compute Cloud (Amazon EC2) instances with attached Amazon EBS Volumes"
  }, {
    "option" : "C",
    "description" : " AWS Storage Gateway Gateway-Cached volumes"
  }, {
    "option" : "D",
    "description" : " AWS Import/Export Disk"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 6,
    "options" : [ "B" ],
    "description" : "Simple AD is a Microsoft Active Directory-compatible directory that is powered by Samba 4. Simple AD supports commonly used Active Directory features such as user accounts, group memberships, domain-joining Amazon Elastic Compute Cloud (Amazon EC2) instances running Linux and Microsoft Windows, Kerberos-based Single Sign-On (SSO), and group policies."
  }
}, {
  "index" : 1477,
  "chapter" : 41,
  "number" : 7,
  "asking" : " Your company wants to extend their existing Microsoft Active Directory capability into an Amazon Virtual Private Cloud (Amazon VPC) without establishing a trust relationship with the existing on-premises Active Directory. Which of the following is the best approach to achieve this goal?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create and connect an AWS Directory Service AD Connector."
  }, {
    "option" : "B",
    "description" : " Create and connect an AWS Directory Service Simple AD."
  }, {
    "option" : "C",
    "description" : " Create and connect an AWS Directory Service for Microsoft Active Directory (Enterprise Edition)."
  }, {
    "option" : "D",
    "description" : " None of the above"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 7,
    "options" : [ "C" ],
    "description" : "AWS KMS CMKs are the fundamental resources that AWS KMS manages. CMKs can never leave AWS KMS unencrypted, but data keys can."
  }
}, {
  "index" : 1478,
  "chapter" : 41,
  "number" : 8,
  "asking" : " Which of the following are AWS Key Management Service (AWS KMS) keys that will never exit AWS unencrypted?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS KMS data keys"
  }, {
    "option" : "B",
    "description" : " Envelope encryption keys"
  }, {
    "option" : "C",
    "description" : " AWS KMS Customer Master Keys (CMKs)"
  }, {
    "option" : "D",
    "description" : " A and C"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 8,
    "options" : [ "D" ],
    "description" : "AWS KMS uses envelope encryption to protect data. AWS KMS creates a data key, encrypts it under a Customer Master Key (CMK), and returns plaintext and encrypted versions of the data key to you. You use the plaintext key to encrypt data and store the encrypted key alongside the encrypted data. You can retrieve a plaintext data key only if you have the encrypted data key and you have permission to use the corresponding master key."
  }
}, {
  "index" : 1479,
  "chapter" : 41,
  "number" : 9,
  "asking" : " Which cryptographic method is used by AWS Key Management Service (AWS KMS) to encrypt data?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Password-based encryption"
  }, {
    "option" : "B",
    "description" : " Asymmetric"
  }, {
    "option" : "C",
    "description" : " Shared secret"
  }, {
    "option" : "D",
    "description" : " Envelope encryption"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 9,
    "options" : [ "A" ],
    "description" : "AWS CloudTrail records important information about each API call, including the name of the API, the identity of the caller, the time of the API call, the request parameters, and the response elements returned by the AWS Cloud service."
  }
}, {
  "index" : 1480,
  "chapter" : 41,
  "number" : 10,
  "asking" : " Which AWS service records Application Program Interface (API) calls made on your account and delivers log files to your Amazon Simple Storage Service (Amazon S3) bucket?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS CloudTrail"
  }, {
    "option" : "B",
    "description" : " Amazon CloudWatch"
  }, {
    "option" : "C",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "D",
    "description" : " AWS Data Pipeline"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 10,
    "options" : [ "B", "C" ],
    "description" : "Encryption context is a set of key/value pairs that you can pass to AWS KMS when you call the Encrypt, Decrypt, ReEncrypt, GenerateDataKey, and GenerateDataKeyWithoutPlaintext APIs. Although the encryption context is not included in the ciphertext, it is cryptographically bound to the ciphertext during encryption and must be passed again when you call the Decrypt (or ReEncrypt) API. Invalid ciphertext for decryption is plaintext that has been encrypted in a different AWS account or ciphertext that has been altered since it was originally encrypted."
  }
}, {
  "index" : 1481,
  "chapter" : 41,
  "number" : 11,
  "asking" : " You are trying to decrypt ciphertext with AWS KMS and the decryption operation is failing. Which of the following are possible causes? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The private key does not match the public key in the ciphertext."
  }, {
    "option" : "B",
    "description" : " The plaintext was encrypted along with an encryption context, and you are not providing the identical encryption context when calling the Decrypt API."
  }, {
    "option" : "C",
    "description" : " The ciphertext you are trying to decrypt is not valid."
  }, {
    "option" : "D",
    "description" : " You are not providing the correct symmetric key to the Decrypt API."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 11,
    "options" : [ "B" ],
    "description" : "Because the Internet connection is full, the best solution will be based on using AWS Import/Export to ship the data. The most appropriate storage location for data that must be stored, but is very rarely accessed, is Amazon Glacier."
  }
}, {
  "index" : 1482,
  "chapter" : 41,
  "number" : 12,
  "asking" : " Your company has 30 years of financial records that take up 15TB of on-premises storage. It is regulated that you maintain these records, but in the year you have worked for the company no one has ever requested any of this data. Given that the company data center is already filling the bandwidth of its Internet connection, what is an alternative way to store the data on the most appropriate cloud storage?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Import/Export to Amazon Simple Storage Service (Amazon S3)"
  }, {
    "option" : "B",
    "description" : " AWS Import/Export to Amazon Glacier"
  }, {
    "option" : "C",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "D",
    "description" : " Amazon Elastic MapReduce (AWS EMR)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 12,
    "options" : [ "C" ],
    "description" : "Because the job is run monthly, a persistent cluster will incur unnecessary compute costs during the rest of the month. Amazon Kinesis is not appropriate because the company is running analytics as a batch job and not on a stream. A single large instance does not scale out to accommodate the large compute needs."
  }
}, {
  "index" : 1483,
  "chapter" : 41,
  "number" : 13,
  "asking" : " Your company collects information from the point of sale registers at all of its franchise locations. Each month these processes collect 200TB of information stored in Amazon Simple Storage Service (Amazon S3). Analytics jobs taking 24 hours are performed to gather knowledge from this data. Which of the following will allow you to perform these analytics in a cost-effective way?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Copy the data to a persistent Amazon Elastic MapReduce (Amazon EMR) cluster, and run the MapReduce jobs."
  }, {
    "option" : "B",
    "description" : " Create an application that reads the information of the Amazon S3 bucket and runs it through an Amazon Kinesis stream."
  }, {
    "option" : "C",
    "description" : " Run a transient Amazon EMR cluster, and run the MapReduce jobs against the data directly in Amazon S3."
  }, {
    "option" : "D",
    "description" : " Launch a d2.8xlarge (32 vCPU, 244GB RAM) Amazon Elastic Compute Cloud (Amazon EC2) instance, and run an application to read and process each object sequentially."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 13,
    "options" : [ "D" ],
    "description" : "The Amazon Kinesis services enable you to work with large data streams. Within the Amazon Kinesis family of services, Amazon Kinesis Firehose saves streams to AWS storage services, while Amazon Kinesis Streams provide the ability to process the data in the stream."
  }
}, {
  "index" : 1484,
  "chapter" : 41,
  "number" : 14,
  "asking" : " Which service allows you to process nearly limitless streams of data in flight?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Kinesis Firehose"
  }, {
    "option" : "B",
    "description" : " Amazon Elastic MapReduce (Amazon EMR)"
  }, {
    "option" : "C",
    "description" : " Amazon Redshift"
  }, {
    "option" : "D",
    "description" : " Amazon Kinesis Streams"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 14,
    "options" : [ "C" ],
    "description" : "Amazon Data Pipeline allows you to run regular Extract, Transform, Load (ETL) jobs on Amazon and on-premises data sources. The best storage for large data is Amazon S3, and Amazon Redshift is a large-scale data warehouse service."
  }
}, {
  "index" : 1485,
  "chapter" : 41,
  "number" : 15,
  "asking" : " What combination of services enable you to copy daily 50TB of data to Amazon storage, process the data in Hadoop, and store the results in a large data warehouse?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Kinesis, Amazon Data Pipeline, Amazon Elastic MapReduce (Amazon EMR), and Amazon Elastic Compute Cloud (Amazon EC2)"
  }, {
    "option" : "B",
    "description" : " Amazon Elastic Block Store (Amazon EBS), Amazon Data Pipeline, Amazon EMR, and Amazon Redshift"
  }, {
    "option" : "C",
    "description" : " Amazon Simple Storage Service (Amazon S3), Amazon Data Pipeline, Amazon EMR, and Amazon Redshift"
  }, {
    "option" : "D",
    "description" : " Amazon S3, Amazon Simple Workflow, Amazon EMR, and Amazon DynamoDB"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 15,
    "options" : [ "B" ],
    "description" : "Amazon Kinesis Firehose allows you to ingest massive streams of data and store the data on Amazon S3 (as well as Amazon Redshift and Amazon Elasticsearch)."
  }
}, {
  "index" : 1486,
  "chapter" : 41,
  "number" : 16,
  "asking" : " Your company has 50,000 weather stations around the country that send updates every 2 seconds. What service will enable you to ingest this stream of data and store it to Amazon Simple Storage Service (Amazon S3) for future processing?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Simple Queue Service (Amazon SQS)"
  }, {
    "option" : "B",
    "description" : " Amazon Kinesis Firehose"
  }, {
    "option" : "C",
    "description" : " Amazon Elastic Compute Cloud (Amazon EC2)"
  }, {
    "option" : "D",
    "description" : " Amazon Data Pipeline"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 16,
    "options" : [ "C" ],
    "description" : "AWS OpsWorks uses Chef recipes to start new app server instances, configure application server software, and deploy applications. Organizations can leverage Chef recipes to automate operations like software configurations, package installations, database setups, server scaling, and code deployment."
  }
}, {
  "index" : 1487,
  "chapter" : 41,
  "number" : 17,
  "asking" : " Your organization uses Chef heavily for its deployment automation. What AWS cloud service provides integration with Chef recipes to start new application server instances, configure application server software, and deploy applications?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Elastic Beanstalk"
  }, {
    "option" : "B",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "C",
    "description" : " AWS OpsWorks"
  }, {
    "option" : "D",
    "description" : " AWS CloudFormation"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 17,
    "options" : [ "A" ],
    "description" : "With AWS CloudFormation, you can reuse your template to set up your resources consistently and repeatedly. Just describe your resources once and then provision the same resources over and over in multiple stacks."
  }
}, {
  "index" : 1488,
  "chapter" : 41,
  "number" : 18,
  "asking" : " A firm is moving its testing platform to AWS to provide developers with instant access to clean test and development environments. The primary requirement for the firm is to make environments easily reproducible and fungible. What service will help the firm meet their requirements?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS CloudFormation"
  }, {
    "option" : "B",
    "description" : " AWS Config"
  }, {
    "option" : "C",
    "description" : " Amazon Redshift"
  }, {
    "option" : "D",
    "description" : " AWS Trusted Advisor"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 18,
    "options" : [ "B" ],
    "description" : "AWS Trusted Advisor inspects your AWS environment and makes recommendations when opportunities exist to save money, improve system availability and performance, or help close security gaps. AWS Trusted Advisor draws upon best practices learned from the aggregated operational history of serving hundreds of thousands of AWS customers."
  }
}, {
  "index" : 1489,
  "chapter" : 41,
  "number" : 19,
  "asking" : " Your company’s IT management team is looking for an online tool to provide recommendations to save money, improve system availability and performance, and to help close security gaps. What can help the management team?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Cloud-init"
  }, {
    "option" : "B",
    "description" : " AWS Trusted Advisor"
  }, {
    "option" : "C",
    "description" : " AWS Config"
  }, {
    "option" : "D",
    "description" : " Configuration Recorder"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 19,
    "options" : [ "A" ],
    "description" : "AWS Config is a fully managed service that provides you with an AWS resource inventory, configuration history, and configuration change notifications to enable security and governance. With AWS Config, you can discover existing and deleted AWS resources, determine your overall compliance against rules, and dive into configuration details of a resource at any point in time. These capabilities enable compliance auditing."
  }
}, {
  "index" : 1490,
  "chapter" : 41,
  "number" : 20,
  "asking" : " Your company works with data that requires frequent audits of your AWS environment to ensure compliance with internal policies and best practices. In order to perform these audits, you need access to historical configurations of your resources to evaluate relevant configuration changes. Which service will provide the necessary information for your audits?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Config"
  }, {
    "option" : "B",
    "description" : " AWS Key Management Service (AWS KMS)"
  }, {
    "option" : "C",
    "description" : " AWS CloudTrail"
  }, {
    "option" : "D",
    "description" : " AWS OpsWorks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 11,
    "number" : 20,
    "options" : [ "D" ],
    "description" : "AWS Elastic Beanstalk is the fastest and simplest way to get an application up and running on AWS. Developers can simply upload their application code, and the service automatically handles all the details such as resource provisioning, load balancing, Auto Scaling, and monitoring."
  }
}, {
  "index" : 1491,
  "chapter" : 41,
  "number" : 21,
  "asking" : " All of the website deployments are currently done by your company’s development team. With a surge in website popularity, the company is looking for ways to be more agile with deployments. What AWS cloud service can help the developers focus more on writing code instead of spending time managing and configuring servers, databases, load balancers, firewalls, and networks?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Config"
  }, {
    "option" : "B",
    "description" : " AWS Trusted Advisor"
  }, {
    "option" : "C",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "D",
    "description" : " AWS Elastic Beanstalk"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : null
}, {
  "index" : 1492,
  "chapter" : 42,
  "number" : 1,
  "asking" : " Which is an operational process performed by AWS for data security?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Advanced Encryption Standard (AES)-256 encryption of data stored on any shared storage device"
  }, {
    "option" : "B",
    "description" : " Decommissioning of storage devices using industry-standard practices"
  }, {
    "option" : "C",
    "description" : " Background virus scans of Amazon Elastic Block Store (Amazon EBS) volumes and Amazon EBS snapshots"
  }, {
    "option" : "D",
    "description" : " Replication of data across multiple AWS regions"
  }, {
    "option" : "E",
    "description" : " Secure wiping of Amazon EBS data when an Amazon EBS volume is unmounted"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 1,
    "options" : [ "B" ],
    "description" : "All decommissioned magnetic storage devices are degaussed and physically destroyed in accordance with industry-standard practices."
  }
}, {
  "index" : 1493,
  "chapter" : 42,
  "number" : 2,
  "asking" : " You have launched a Windows Amazon Elastic Compute Cloud (Amazon EC2) instance and specified an Amazon EC2 key pair for the instance at launch. Which of the following accurately describes how to log in to the instance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use the Amazon EC2 key pair to securely connect to the instance via Secure Shell (SSH)."
  }, {
    "option" : "B",
    "description" : " Use your AWS Identity and Access Management (IAM) user X.509 certificate to log in to the instance."
  }, {
    "option" : "C",
    "description" : " Use the Amazon EC2 key pair to decrypt the administrator password and then securely connect to the instance via Remote Desktop Protocol (RDP) as the administrator."
  }, {
    "option" : "D",
    "description" : " A key pair is not needed. Securely connect to the instance via RDP."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 2,
    "options" : [ "C" ],
    "description" : "The administrator password is encrypted with the public key of the key pair, and you provide the private key to decrypt the password. Then log in to the instance as the administrator with the decrypted password."
  }
}, {
  "index" : 1494,
  "chapter" : 42,
  "number" : 3,
  "asking" : " A Database security group controls network access to a database instance that is inside a Virtual Private Cloud (VPC) and by default allows access from?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Access from any IP address for the standard ports that the database uses is provided by default."
  }, {
    "option" : "B",
    "description" : " Access from any IP address for any port is provided by default in the DB security group."
  }, {
    "option" : "C",
    "description" : " No access is provided by default, and any access must be explicitly added with a rule to the DB security group."
  }, {
    "option" : "D",
    "description" : " Access for the database connection string is provided by default in the DB security group."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 3,
    "options" : [ "C" ],
    "description" : "By default, network access is turned off to a DB Instance. You can specify rules in a security group that allows access from an IP address range, port, or Amazon Elastic Compute Cloud (Amazon EC2) security group."
  }
}, {
  "index" : 1495,
  "chapter" : 42,
  "number" : 4,
  "asking" : " Which encryption algorithm is used by Amazon Simple Storage Service (Amazon S3) to encrypt data at rest with Service-Side Encryption (SSE)?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Advanced Encryption Standard (AES)-256"
  }, {
    "option" : "B",
    "description" : " RSA 1024"
  }, {
    "option" : "C",
    "description" : " RSA 2048"
  }, {
    "option" : "D",
    "description" : " AES-128"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 4,
    "options" : [ "A" ],
    "description" : "Amazon S3 SSE uses one of the strongest block ciphers available, 256-bit AES."
  }
}, {
  "index" : 1496,
  "chapter" : 42,
  "number" : 5,
  "asking" : " How many access keys may an AWS Identity and Access Management (IAM) user have active at one time?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " 0"
  }, {
    "option" : "B",
    "description" : " 1"
  }, {
    "option" : "C",
    "description" : " 2"
  }, {
    "option" : "D",
    "description" : " 3"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 5,
    "options" : [ "C" ],
    "description" : "IAM permits users to have no more than two active access keys at one time."
  }
}, {
  "index" : 1497,
  "chapter" : 42,
  "number" : 6,
  "asking" : " Which of the following is the name of the security model employed by AWS with its customers?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The shared secret model"
  }, {
    "option" : "B",
    "description" : " The shared responsibility model"
  }, {
    "option" : "C",
    "description" : " The shared secret key model"
  }, {
    "option" : "D",
    "description" : " The secret key responsibility model"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 6,
    "options" : [ "B" ],
    "description" : "The shared responsibility model is the name of the model employed by AWS with its customers."
  }
}, {
  "index" : 1498,
  "chapter" : 42,
  "number" : 7,
  "asking" : " Which of the following describes the scheme used by an Amazon Redshift cluster leveraging AWS Key Management Service (AWS KMS) to encrypt data-at-rest?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Redshift uses a one-tier, key-based architecture for encryption."
  }, {
    "option" : "B",
    "description" : " Amazon Redshift uses a two-tier, key-based architecture for encryption."
  }, {
    "option" : "C",
    "description" : " Amazon Redshift uses a three-tier, key-based architecture for encryption."
  }, {
    "option" : "D",
    "description" : " Amazon Redshift uses a four-tier, key-based architecture for encryption."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 7,
    "options" : [ "D" ],
    "description" : "When you choose AWS KMS for key management with Amazon Redshift, there is a four-tier hierarchy of encryption keys. These keys are the master key, a cluster key, a database key, and data encryption keys."
  }
}, {
  "index" : 1499,
  "chapter" : 42,
  "number" : 8,
  "asking" : " Which of the following Elastic Load Balancing options ensure that the load balancer determines which cipher is used for a Secure Sockets Layer (SSL) connection?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Client Server Cipher Suite"
  }, {
    "option" : "B",
    "description" : " Server Cipher Only"
  }, {
    "option" : "C",
    "description" : " First Server Cipher"
  }, {
    "option" : "D",
    "description" : " Server Order Preference"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 8,
    "options" : [ "D" ],
    "description" : "Elastic Load Balancing supports the Server Order Preference option for negotiating connections between a client and a load balancer. During the SSL connection negotiation process, the client and the load balancer present a list of ciphers and protocols that they each support, in order of preference. By default, the first cipher on the client’s list that matches any one of the load balancer’s ciphers is selected for the SSL connection. If the load balancer is configured to support Server Order Preference, then the load balancer selects the first cipher in its list that is in the client’s list of ciphers. This ensures that the load balancer determines which cipher is used for SSL connection. If you do not enable Server Order Preference, the order of ciphers presented by the client is used to negotiate connections between the client and the load balancer."
  }
}, {
  "index" : 1500,
  "chapter" : 42,
  "number" : 9,
  "asking" : " Which technology does Amazon WorkSpaces use to provide data security?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Secure Sockets Layer (SSL)/Transport Layer Security (TLS)"
  }, {
    "option" : "B",
    "description" : " Advanced Encryption Standard (AES)-256"
  }, {
    "option" : "C",
    "description" : " PC-over-IP (PCoIP)"
  }, {
    "option" : "D",
    "description" : " AES-128"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 9,
    "options" : [ "C" ],
    "description" : "Amazon WorkSpaces uses PCoIP, which provides an interactive video stream without transmitting actual data."
  }
}, {
  "index" : 1501,
  "chapter" : 42,
  "number" : 10,
  "asking" : " As a Solutions Architect, how should you architect systems on AWS?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " You should architect for least cost."
  }, {
    "option" : "B",
    "description" : " You should architect your AWS usage to take advantage of Amazon Simple Storage Service’s (Amazon S3) durability."
  }, {
    "option" : "C",
    "description" : " You should architect your AWS usage to take advantage of multiple regions and Availability Zones."
  }, {
    "option" : "D",
    "description" : " You should architect with Amazon Elastic Compute Cloud (Amazon EC2) Auto Scaling to ensure capacity is available when needed."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 10,
    "options" : [ "C" ],
    "description" : "Distributing applications across multiple Availability Zones provides the ability to remain resilient in the face of most failure modes, including natural disasters or system failures."
  }
}, {
  "index" : 1502,
  "chapter" : 42,
  "number" : 11,
  "asking" : " Which security scheme is used by the AWS Multi-Factor Authentication (AWS MFA) token?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Time-Based One-Time Password (TOTP)"
  }, {
    "option" : "B",
    "description" : " Perfect Forward Secrecy (PFC)"
  }, {
    "option" : "C",
    "description" : " Ephemeral Diffie Hellman (EDH)"
  }, {
    "option" : "D",
    "description" : " Split-Key Encryption (SKE)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 11,
    "options" : [ "A" ],
    "description" : "A virtual MFA device uses a software application that generates six-digit authentication codes that are compatible with the TOTP standard, as described in RFC"
  }
}, {
  "index" : 1503,
  "chapter" : 42,
  "number" : 12,
  "asking" : " DynamoDB tables may contain sensitive data that needs to be protected. Which of the following is a way for you to protect DynamoDB table content? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " DynamoDB encrypts all data server-side by default so nothing is required."
  }, {
    "option" : "B",
    "description" : " DynamoDB can store data encrypted with a client-side encryption library solution before storing the data in DynamoDB."
  }, {
    "option" : "C",
    "description" : " DynamoDB obfuscates all data stored so encryption is not required."
  }, {
    "option" : "D",
    "description" : " DynamoDB can be used with the AWS Key Management Service to encrypt the data before storing the data in DynamoDB."
  }, {
    "option" : "E",
    "description" : " DynamoDB should not be used to store sensitive information requiring protection."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 12,
    "options" : [ "B", "D" ],
    "description" : "Amazon DynamoDB does not have a server-side feature to encrypt items within a table. You need to use a solution outside of DynamoDB such as a client-side library to encrypt items before storing them, or a key management service like AWS Key Management Service to manage keys that are used to encrypt items before storing them in DynamoDB."
  }
}, {
  "index" : 1504,
  "chapter" : 42,
  "number" : 13,
  "asking" : " You have launched an Amazon Linux Elastic Compute Cloud (Amazon EC2) instance into EC2-Classic, and the instance has successfully passed the System Status Check and Instance Status Check. You attempt to securely connect to the instance via Secure Shell (SSH) and receive the response, “WARNING: UNPROTECTED PRIVATE KEY FILE,” after which the login fails. Which of the following is the cause of the failed login?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " You are using the wrong private key."
  }, {
    "option" : "B",
    "description" : " The permissions for the private key are too insecure for the key to be trusted."
  }, {
    "option" : "C",
    "description" : " A security group rule is blocking the connection."
  }, {
    "option" : "D",
    "description" : " A security group rule has not been associated with the private key."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 13,
    "options" : [ "B" ],
    "description" : "If your private key can be read or written to by anyone but you, then SSH ignores your key."
  }
}, {
  "index" : 1505,
  "chapter" : 42,
  "number" : 14,
  "asking" : " Which of the following public identity providers are supported by Amazon Cognito Identity?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon"
  }, {
    "option" : "B",
    "description" : " Google"
  }, {
    "option" : "C",
    "description" : " Facebook"
  }, {
    "option" : "D",
    "description" : " All of the above"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 14,
    "options" : [ "D" ],
    "description" : "Amazon Cognito Identity supports public identity providers—Amazon, Facebook, and Google—as well as unauthenticated identities."
  }
}, {
  "index" : 1506,
  "chapter" : 42,
  "number" : 15,
  "asking" : " Which feature of AWS is designed to permit calls to the platform from an Amazon Elastic Compute Cloud (Amazon EC2) instance without needing access keys placed on the instance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS Identity and Access Management (IAM) instance profile"
  }, {
    "option" : "B",
    "description" : " IAM groups"
  }, {
    "option" : "C",
    "description" : " IAM roles"
  }, {
    "option" : "D",
    "description" : " Amazon EC2 key pairs"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 15,
    "options" : [ "A" ],
    "description" : "An instance profile is a container for an IAM role that you can use to pass role information to an Amazon EC2 instance when the instance starts."
  }
}, {
  "index" : 1507,
  "chapter" : 42,
  "number" : 16,
  "asking" : " Which of the following Amazon Virtual Private Cloud (Amazon VPC) elements acts as a stateless firewall?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Security group"
  }, {
    "option" : "B",
    "description" : " Network Access Control List (ACL)"
  }, {
    "option" : "C",
    "description" : " Network Address Translation (NAT) instance"
  }, {
    "option" : "D",
    "description" : " An Amazon VPC endpoint"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 16,
    "options" : [ "B" ],
    "description" : "A network ACL is an optional layer of security for your Amazon VPC that acts as a firewall for controlling traffic in and out of one or more subnets. You might set up network ACLs with rules similar to your security groups in order to add an additional layer of security to your Amazon VPC."
  }
}, {
  "index" : 1508,
  "chapter" : 42,
  "number" : 17,
  "asking" : " Which of the following is the most recent version of the AWS digital signature calculation process?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Signature Version 1"
  }, {
    "option" : "B",
    "description" : " Signature Version 2"
  }, {
    "option" : "C",
    "description" : " Signature Version 3"
  }, {
    "option" : "D",
    "description" : " Signature Version 4"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 17,
    "options" : [ "D" ],
    "description" : "The Signature Version 4 signing process describes how to add authentication information to AWS requests. For security, most requests to AWS must be signed with an access key (Access Key ID [AKI] and Secret Access Key [SAK]). If you use the AWS Command Line Interface (AWS CLI) or one of the AWS Software Development Kits (SDKs), those tools automatically sign requests for you based on credentials that you specify when you configure the tools. However, if you make direct HTTP or HTTPS calls to AWS, you must sign the requests yourself."
  }
}, {
  "index" : 1509,
  "chapter" : 42,
  "number" : 18,
  "asking" : " Which of the following is the name of the feature within Amazon Virtual Private Cloud (Amazon VPC) that allows you to launch Amazon Elastic Compute Cloud (Amazon EC2) instances on hardware dedicated to a single customer?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon VPC-based tenancy"
  }, {
    "option" : "B",
    "description" : " Dedicated tenancy"
  }, {
    "option" : "C",
    "description" : " Default tenancy"
  }, {
    "option" : "D",
    "description" : " Host-based tenancy"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 18,
    "options" : [ "B" ],
    "description" : "Dedicated instances are physically isolated at the host hardware level from your instances that aren’t dedicated instances and from instances that belong to other AWS accounts."
  }
}, {
  "index" : 1510,
  "chapter" : 42,
  "number" : 19,
  "asking" : " Which of the following describes how Amazon Elastic MapReduce (Amazon EMR) protects access to the cluster?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The master node and the slave nodes are launched into an Amazon Virtual Private Cloud (Amazon VPC)."
  }, {
    "option" : "B",
    "description" : " The master node supports a Virtual Private Network (VPN) connection from the key specified at cluster launch."
  }, {
    "option" : "C",
    "description" : " The master node is launched into a security group that allows Secure Shell (SSH) and service access, while the slave nodes are launched into a separate security group that only permits communication with the master node."
  }, {
    "option" : "D",
    "description" : " The master node and slave nodes are launched into a security group that allows SSH and service access."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 19,
    "options" : [ "C" ],
    "description" : "Amazon EMR starts your instances in two Amazon Elastic Compute Cloud (Amazon EC2) security groups, one for the master and another for the slaves. The master security group has a port open for communication with the service. It also has the SSH port open to allow you to securely connect to the instances via SSH using the key specified at startup. The slaves start in a separate security group, which only allows interaction with the master instance. By default, both security groups are set up to prevent access from external sources, including Amazon EC2 instances belonging to other customers. Because these are security groups in your account, you can reconfigure them using the standard Amazon EC2 tools or dashboard."
  }
}, {
  "index" : 1511,
  "chapter" : 42,
  "number" : 20,
  "asking" : " To help prevent data loss due to the failure of any single hardware component, Amazon Elastic Block Storage (Amazon EBS) automatically replicates EBS volume data to which of the following?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon EBS replicates EBS volume data within the same Availability Zone in a region."
  }, {
    "option" : "B",
    "description" : " Amazon EBS replicates EBS volume data across other Availability Zones within the same region."
  }, {
    "option" : "C",
    "description" : " Amazon EBS replicates EBS volume data across Availability Zones in the same region and in Availability Zones in one other region."
  }, {
    "option" : "D",
    "description" : " Amazon EBS replicates EBS volume data across Availability Zones in the same region and in Availability Zones in every other region."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 12,
    "number" : 20,
    "options" : [ "A" ],
    "description" : "When you create an Amazon EBS volume in an Availability Zone, it is automatically replicated within that Availability Zone to prevent data loss due to failure of any single hardware component. An EBS Snapshot creates a copy of an EBS volume to Amazon S3 so that copies of the volume can reside in different Availability Zones within a region."
  }
}, {
  "index" : 1512,
  "chapter" : 43,
  "number" : 1,
  "asking" : " AWS communicates with customers regarding its security and control environment through a variety of different mechanisms. Which of the following are valid mechanisms? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Obtaining industry certifications and independent third-party attestations"
  }, {
    "option" : "B",
    "description" : " Publishing information about security and AWS control practices via the website, whitepapers, and blogs"
  }, {
    "option" : "C",
    "description" : " Directly providing customers with certificates, reports, and other documentation (under NDA in some cases)"
  }, {
    "option" : "D",
    "description" : " Allowing customers’ auditors direct access to AWS data centers, infrastructure, and senior staff"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 1,
    "options" : [ "A", "B", "C" ],
    "description" : "Answers A through C describe valid mechanisms that AWS uses to communicate with customers regarding its security and control environment. AWS does not allow customers’ auditors direct access to AWS data centers, infrastructure, or staff."
  }
}, {
  "index" : 1513,
  "chapter" : 43,
  "number" : 2,
  "asking" : " Which of the following statements is true when it comes to the AWS shared responsibility model?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The shared responsibility model is limited to security considerations only; it does not extend to IT controls."
  }, {
    "option" : "B",
    "description" : " The shared responsibility model is only applicable for customers who want to be compliant with SOC 1 Type II."
  }, {
    "option" : "C",
    "description" : " The shared responsibility model is not just limited to security considerations; it also extends to IT controls."
  }, {
    "option" : "D",
    "description" : " The shared responsibility model is only applicable for customers who want to be compliant with ISO 27001."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 2,
    "options" : [ "C" ],
    "description" : "The shared responsibility model can include IT controls, and it is not just limited to security considerations. Therefore, answer C is correct."
  }
}, {
  "index" : 1514,
  "chapter" : 43,
  "number" : 3,
  "asking" : " AWS provides IT control information to customers in which of the following ways?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " By using specific control definitions or through general control standard compliance"
  }, {
    "option" : "B",
    "description" : " By using specific control definitions or through SAS 70"
  }, {
    "option" : "C",
    "description" : " By using general control standard compliance and by complying with ISO 27001"
  }, {
    "option" : "D",
    "description" : " By complying with ISO 27001 and SOC 1 Type II"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 3,
    "options" : [ "A" ],
    "description" : "AWS provides IT control information to customers through either specific control definitions or general control standard compliance."
  }
}, {
  "index" : 1515,
  "chapter" : 43,
  "number" : 4,
  "asking" : " Which of the following is a valid report, certification, or third-party attestation for AWS? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " SOC 1"
  }, {
    "option" : "B",
    "description" : " PCI DSS Level 1"
  }, {
    "option" : "C",
    "description" : " SOC 4"
  }, {
    "option" : "D",
    "description" : " ISO 27001"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 4,
    "options" : [ "A", "B", "D" ],
    "description" : "There is no such thing as a SOC 4 report, therefore answer C is incorrect."
  }
}, {
  "index" : 1516,
  "chapter" : 43,
  "number" : 5,
  "asking" : " Which of the following statements is true?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " IT governance is still the customer’s responsibility, despite deploying their IT estate onto the AWS platform."
  }, {
    "option" : "B",
    "description" : " The AWS platform is PCI DSS-compliant to Level 1. Customers can deploy their web applications to this platform, and they will be PCI DSS-compliant automatically."
  }, {
    "option" : "C",
    "description" : " The shared responsibility model applies to IT security only; it does not relate to governance."
  }, {
    "option" : "D",
    "description" : " AWS doesn’t take risk management very seriously, and it’s up to the customer to mitigate risks to the AWS infrastructure."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 5,
    "options" : [ "A" ],
    "description" : "IT governance is still the customer’s responsibility."
  }
}, {
  "index" : 1517,
  "chapter" : 43,
  "number" : 6,
  "asking" : " Which of the following statements is true when it comes to the risk and compliance advantages of the AWS environment?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Workloads must be moved entirely into the AWS Cloud in order to be compliant with various certifications and third-party attestations."
  }, {
    "option" : "B",
    "description" : " The critical components of a workload must be moved entirely into the AWS Cloud in order to be compliant with various certifications and third-party attestations, but the non-critical components do not."
  }, {
    "option" : "C",
    "description" : " The non-critical components of a workload must be moved entirely into the AWS Cloud in order to be compliant with various certifications and third-party attestations, but the critical components do not."
  }, {
    "option" : "D",
    "description" : " Few, many, or all components of a workload can be moved to the AWS Cloud, but it is the customer’s responsibility to ensure that their entire workload remains compliant with various certifications and third-party attestations."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 6,
    "options" : [ "D" ],
    "description" : "Any number of components of a workload can be moved into AWS, but it is the customer’s responsibility to ensure that the entire workload remains compliant with various certifications and third-party attestations."
  }
}, {
  "index" : 1518,
  "chapter" : 43,
  "number" : 7,
  "asking" : " Which of the following statements best describes an Availability Zone?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Each Availability Zone consists of a single discrete data center with redundant power and networking/connectivity."
  }, {
    "option" : "B",
    "description" : " Each Availability Zone consists of multiple discrete data centers with redundant power and networking/connectivity."
  }, {
    "option" : "C",
    "description" : " Each Availability Zone consists of multiple discrete regions, each with a single data center with redundant power and networking/connectivity."
  }, {
    "option" : "D",
    "description" : " Each Availability Zone consists of multiple discrete data centers with shared power and redundant networking/connectivity."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 7,
    "options" : [ "B" ],
    "description" : "An Availability Zone consists of multiple discrete data centers, each with their own redundant power and networking/connectivity, therefore answer B is correct."
  }
}, {
  "index" : 1519,
  "chapter" : 43,
  "number" : 8,
  "asking" : " With regard to vulnerability scans and threat assessments of the AWS platform, which of the following statements are true? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS regularly performs scans of public-facing endpoint IP addresses for vulnerabilities."
  }, {
    "option" : "B",
    "description" : " Scans performed by AWS include customer instances."
  }, {
    "option" : "C",
    "description" : " AWS security notifies the appropriate parties to remediate any identified vulnerabilities."
  }, {
    "option" : "D",
    "description" : " Customers can perform their own scans at any time without advance notice."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 8,
    "options" : [ "A", "C" ],
    "description" : "AWS regularly scans public-facing, non-customer endpoint IP addresses and notifies appropriate parties. AWS does not scan customer instances, and customers must request the ability to perform their own scans in advance, therefore answers A and C are correct."
  }
}, {
  "index" : 1520,
  "chapter" : 43,
  "number" : 9,
  "asking" : " Which of the following best describes the risk and compliance communication responsibilities of customers to AWS?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS and customers both communicate their security and control environment information to each other at all times."
  }, {
    "option" : "B",
    "description" : " AWS publishes information about the AWS security and control practices online, and directly to customers under NDA. Customers do not need to communicate their use and configurations to AWS."
  }, {
    "option" : "C",
    "description" : " Customers communicate their use and configurations to AWS at all times. AWS does not communicate AWS security and control practices to customers for security reasons."
  }, {
    "option" : "D",
    "description" : " Both customers and AWS keep their security and control practices entirely confidential and do not share them in order to ensure the greatest security for all parties."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 9,
    "options" : [ "B" ],
    "description" : "AWS publishes information publicly online and directly to customers under NDA, but customers are not required to share their use and configuration information with AWS, therefore answer B is correct."
  }
}, {
  "index" : 1521,
  "chapter" : 43,
  "number" : 10,
  "asking" : " When it comes to risk management, which of the following is true?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS does not develop a strategic business plan; risk management and mitigation is entirely the responsibility of the customer."
  }, {
    "option" : "B",
    "description" : " AWS has developed a strategic business plan to identify any risks and implemented controls to mitigate or manage those risks. Customers do not need to develop and maintain their own risk management plans."
  }, {
    "option" : "C",
    "description" : " AWS has developed a strategic business plan to identify any risks and has implemented controls to mitigate or manage those risks. Customers should also develop and maintain their own risk management plans to ensure they are compliant with any relevant controls and certifications."
  }, {
    "option" : "D",
    "description" : " Neither AWS nor the customer needs to worry about risk management, so no plan is needed from either party."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 10,
    "options" : [ "C" ],
    "description" : "AWS has developed a strategic business plan, and customers should also develop and maintain their own risk management plans, therefore answer C is correct."
  }
}, {
  "index" : 1522,
  "chapter" : 43,
  "number" : 11,
  "asking" : " The AWS control environment is in place for the secure delivery of AWS Cloud service offerings. Which of the following does the collective control environment NOT explicitly include?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " People"
  }, {
    "option" : "B",
    "description" : " Energy"
  }, {
    "option" : "C",
    "description" : " Technology"
  }, {
    "option" : "D",
    "description" : " Processes"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 11,
    "options" : [ "B" ],
    "description" : "The collective control environment includes people, processes, and technology necessary to establish and maintain an environment that supports the operating effectiveness of AWS control framework. Energy is not a discretely identified part of the control environment, therefore B is the correct answer."
  }
}, {
  "index" : 1523,
  "chapter" : 43,
  "number" : 12,
  "asking" : " Who is responsible for the configuration of security groups in an AWS environment?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " The customer and AWS are both jointly responsible for ensuring that security groups are correctly and securely configured."
  }, {
    "option" : "B",
    "description" : " AWS is responsible for ensuring that all security groups are correctly and securely configured. Customers do not need to worry about security group configuration."
  }, {
    "option" : "C",
    "description" : " Neither AWS nor the customer is responsible for the configuration of security groups; security groups are intelligently and automatically configured using traffic heuristics."
  }, {
    "option" : "D",
    "description" : " AWS provides the security group functionality as a service, but the customer is responsible for correctly and securely configuring their own security groups."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 12,
    "options" : [ "D" ],
    "description" : "Customers are responsible for ensuring all of their security group configurations are appropriate for their own applications, therefore answer D is correct."
  }
}, {
  "index" : 1524,
  "chapter" : 43,
  "number" : 13,
  "asking" : " Which of the following is NOT a recommended approach for customers trying to achieve strong compliance and governance over an entire IT control environment?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Take a holistic approach: review information available from AWS together with all other information, and document all compliance requirements."
  }, {
    "option" : "B",
    "description" : " Verify that all control objectives are met and all key controls are designed and operating effectively."
  }, {
    "option" : "C",
    "description" : " Implement generic control objectives that are not specifically designed to meet their organization’s compliance requirements."
  }, {
    "option" : "D",
    "description" : " Identify and document controls owned by all third parties."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 13,
    "number" : 13,
    "options" : [ "C" ],
    "description" : "Customers should ensure that they implement control objectives that are designed to meet their organization’s own unique compliance requirements, therefore answer C is correct."
  }
}, {
  "index" : 1525,
  "chapter" : 44,
  "number" : 1,
  "asking" : " When designing a loosely coupled system, which AWS services provide an intermediate durable storage layer between components? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon CloudFront"
  }, {
    "option" : "B",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "C",
    "description" : " Amazon Route 53"
  }, {
    "option" : "D",
    "description" : " AWS CloudFormation"
  }, {
    "option" : "E",
    "description" : " Amazon Simple Queue Service (Amazon SQS)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 1,
    "options" : [ "B", "E" ],
    "description" : "Amazon Kinesis is a platform for streaming data on AWS, offering powerful services to make it easy to load and analyze streaming data. Amazon SQS is a fast, reliable, scalable, and fully managed message queuing service. Amazon SQS makes it simple and cost-effective to decouple the components of a cloud application."
  }
}, {
  "index" : 1526,
  "chapter" : 44,
  "number" : 2,
  "asking" : " Which of the following options will help increase the availability of a web server farm? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Use Amazon CloudFront to deliver content to the end users with low latency and high data transfer speeds."
  }, {
    "option" : "B",
    "description" : " Launch the web server instances across multiple Availability Zones."
  }, {
    "option" : "C",
    "description" : " Leverage Auto Scaling to recover from failed instances."
  }, {
    "option" : "D",
    "description" : " Deploy the instances in an Amazon Virtual Private Cloud (Amazon VPC)."
  }, {
    "option" : "E",
    "description" : " Add more CPU and RAM to each instance."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 2,
    "options" : [ "B", "C" ],
    "description" : "Launching instances across multiple Availability Zones helps ensure the application is isolated from failures in a single Availability Zone, allowing the application to achieve higher availability. Whether you are running one Amazon EC2 instance or thousands, you can use Auto Scaling to detect impaired Amazon EC2 instances and unhealthy applications and replace the instances without your intervention. This ensures that your application is getting the compute capacity that you expect, thereby maintaining your availability."
  }
}, {
  "index" : 1527,
  "chapter" : 44,
  "number" : 3,
  "asking" : " Which of the following AWS Cloud services are designed according to the Multi-AZ principle? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "B",
    "description" : " Amazon ElastiCache"
  }, {
    "option" : "C",
    "description" : " Elastic Load Balancing"
  }, {
    "option" : "D",
    "description" : " Amazon Virtual Private Cloud (Amazon VPC)"
  }, {
    "option" : "E",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 3,
    "options" : [ "A", "E" ],
    "description" : "Amazon DynamoDB runs across AWS proven, high-availability data centers. The service replicates data across three facilities in an AWS region to provide fault tolerance in the event of a server failure or Availability Zone outage. Amazon S3 provides durable infrastructure to store important data and is designed for durability of 99.999999999% of objects. Your data is redundantly stored across multiple facilities and multiple devices in each facility. While Elastic Load Balancing and Amazon ElastiCache can be deployed across multiple Availability Zones, you must explicitly take such steps when creating them."
  }
}, {
  "index" : 1528,
  "chapter" : 44,
  "number" : 4,
  "asking" : " Your e-commerce site was designed to be stateless and currently runs on a fleet of Amazon Elastic Compute Cloud (Amazon EC2) instances. In an effort to control cost and increase availability, you have a requirement to scale the fleet based on CPU and network utilization to match the demand curve for your site. What services do you need to meet this requirement? (Choose 2 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon CloudWatch"
  }, {
    "option" : "B",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "C",
    "description" : " Elastic Load Balancing"
  }, {
    "option" : "D",
    "description" : " Auto Scaling"
  }, {
    "option" : "E",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 4,
    "options" : [ "A", "D" ],
    "description" : "Auto Scaling enables you to follow the demand curve for your applications closely, reducing the need to provision Amazon EC2 capacity manually in advance. For example, you can set a condition to add new Amazon EC2 instances in increments to the Auto Scaling group when the average CPU and network utilization of your Amazon EC2 fleet monitored in Amazon CloudWatch is high; similarly, you can set a condition to remove instances in the same increments when CPU and network utilization are low."
  }
}, {
  "index" : 1529,
  "chapter" : 44,
  "number" : 5,
  "asking" : " Your compliance department has mandated a new requirement that all data on Amazon Elastic Block Storage (Amazon EBS) volumes must be encrypted. Which of the following steps would you follow for your existing Amazon EBS volumes to comply with the new requirement? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Move the existing Amazon EBS volume into an Amazon Virtual Private Cloud (Amazon VPC)."
  }, {
    "option" : "B",
    "description" : " Create a new Amazon EBS volume with encryption enabled."
  }, {
    "option" : "C",
    "description" : " Modify the existing Amazon EBS volume properties to enable encryption."
  }, {
    "option" : "D",
    "description" : " Attach an Amazon EBS volume with encryption enabled to the instance that hosts the data, then migrate the data to the encryption-enabled Amazon EBS volume."
  }, {
    "option" : "E",
    "description" : " Copy the data from the unencrypted Amazon EBS volume to the Amazon EBS volume with encryption enabled."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 5,
    "options" : [ "B", "D", "E" ],
    "description" : "There is no direct way to encrypt an existing unencrypted volume. However, you can migrate data between encrypted and unencrypted volumes."
  }
}, {
  "index" : 1530,
  "chapter" : 44,
  "number" : 6,
  "asking" : " When building a Distributed Denial of Service (DDoS)-resilient architecture, how does Amazon Virtual Private Cloud (Amazon VPC) help minimize the attack surface area? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Reduces the number of necessary Internet entry points"
  }, {
    "option" : "B",
    "description" : " Combines end user traffic with management traffic"
  }, {
    "option" : "C",
    "description" : " Obfuscates necessary Internet entry points to the level that untrusted end users cannot access them"
  }, {
    "option" : "D",
    "description" : " Adds non-critical Internet entry points to the architecture"
  }, {
    "option" : "E",
    "description" : " Scales the network to absorb DDoS attacks"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 6,
    "options" : [ "A", "C", "D" ],
    "description" : "The attack surface is composed of the different Internet entry points that allow access to your application. The strategy to minimize the attack surface area is to (a) reduce the number of necessary Internet entry points, (b) eliminate non-critical Internet entry points, (c) separate end user traffic from management traffic, (d) obfuscate necessary Internet entry points to the level that untrusted end users cannot access them, and (e) decouple Internet entry points to minimize the effects of attacks. This strategy can be accomplished with Amazon VPC."
  }
}, {
  "index" : 1531,
  "chapter" : 44,
  "number" : 7,
  "asking" : " Your e-commerce application provides daily and ad hoc reporting to various business units on customer purchases. This is resulting in an extremely high level of read traffic to your MySQL Amazon Relational Database Service (Amazon RDS) instance. What can you do to scale up read traffic without impacting your database’s performance?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Increase the allocated storage for the Amazon RDS instance."
  }, {
    "option" : "B",
    "description" : " Modify the Amazon RDS instance to be a Multi-AZ deployment."
  }, {
    "option" : "C",
    "description" : " Create a read replica for an Amazon RDS instance."
  }, {
    "option" : "D",
    "description" : " Change the Amazon RDS instance DB engine version."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 7,
    "options" : [ "C" ],
    "description" : "Amazon RDS read replicas provide enhanced performance and durability for Amazon RDS instances. This replication feature makes it easy to scale out elastically beyond the capacity constraints of a single Amazon RDS instance for read-heavy database workloads. You can create one or more replicas of a given source Amazon RDS instance and serve high-volume application read traffic from multiple copies of your data, thereby increasing aggregate read throughput."
  }
}, {
  "index" : 1532,
  "chapter" : 44,
  "number" : 8,
  "asking" : " Your website is hosted on a fleet of web servers that are load balanced across multiple Availability Zones using an Elastic Load Balancer (ELB). What type of record set in Amazon Route 53 can be used to point myawesomeapp.com to your website?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Type A Alias resource record set"
  }, {
    "option" : "B",
    "description" : " MX record set"
  }, {
    "option" : "C",
    "description" : " TXT record set"
  }, {
    "option" : "D",
    "description" : " CNAME record set"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 8,
    "options" : [ "A" ],
    "description" : "An alias resource record set can point to an ELB. You cannot create a CNAME record at the top node of a Domain Name Service (DNS) namespace, also known as the zone apex, as the case in this example. Alias resource record sets can save you time because Amazon Route 53 automatically recognizes changes in the resource record sets to which the alias resource record set refers."
  }
}, {
  "index" : 1533,
  "chapter" : 44,
  "number" : 9,
  "asking" : " You need a secure way to distribute your AWS credentials to an application running on Amazon Elastic Compute Cloud (Amazon EC2) instances in order to access supplementary AWS Cloud services. What approach provides your application access to use short-term credentials for signing requests while protecting those credentials from other users?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Add your credentials to the UserData parameter of each Amazon EC2 instance."
  }, {
    "option" : "B",
    "description" : " Use a configuration file to store your access and secret keys on the Amazon EC2 instances."
  }, {
    "option" : "C",
    "description" : " Specify your access and secret keys directly in your application."
  }, {
    "option" : "D",
    "description" : " Provision the Amazon EC2 instances with an instance profile that has the appropriate privileges."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 9,
    "options" : [ "D" ],
    "description" : "An instance profile is a container for an AWS Identity and Access Management (IAM) role that you can use to pass role information to an Amazon EC2 instance when the instance starts. The IAM role should have a policy attached that only allows access to the AWS Cloud services necessary to perform its function."
  }
}, {
  "index" : 1534,
  "chapter" : 44,
  "number" : 10,
  "asking" : " You are running a suite of microservices on AWS Lambda that provide the business logic and access to data stored in Amazon DynamoDB for your task management system. You need to create well-defined RESTful Application Program Interfaces (APIs) for these microservices that will scale with traffic to support a new mobile application. What AWS Cloud service can you use to create the necessary RESTful APIs?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Kinesis"
  }, {
    "option" : "B",
    "description" : " Amazon API Gateway"
  }, {
    "option" : "C",
    "description" : " Amazon Cognito"
  }, {
    "option" : "D",
    "description" : " Amazon Elastic Compute Cloud (Amazon EC2) Container Registry"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 10,
    "options" : [ "B" ],
    "description" : "Amazon API Gateway is a fully managed service that makes it easy for developers to publish, maintain, monitor, and secure APIs at any scale. You can create an API that acts as a “front door” for applications to access data, business logic, or functionality from your code running on AWS Lambda. Amazon API Gateway handles all of the tasks involved in accepting and processing up to hundreds of thousands of concurrent API calls, including traffic management, authorization and access control, monitoring, and API version management."
  }
}, {
  "index" : 1535,
  "chapter" : 44,
  "number" : 11,
  "asking" : " Your WordPress website is hosted on a fleet of Amazon Elastic Compute Cloud (Amazon EC2) instances that leverage Auto Scaling to provide high availability. To ensure that the content of the WordPress site is sustained through scale up and scale down events, you need a common file system that is shared between more than one Amazon EC2 instance. Which AWS Cloud service can meet this requirement?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon CloudFront"
  }, {
    "option" : "B",
    "description" : " Amazon ElastiCache"
  }, {
    "option" : "C",
    "description" : " Amazon Elastic File System (Amazon EFS)"
  }, {
    "option" : "D",
    "description" : " Amazon Elastic Beanstalk"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 11,
    "options" : [ "C" ],
    "description" : "Amazon EFS is a file storage service for Amazon EC2 instances. Multiple Amazon EC2 instances can access an Amazon EFS file system at the same time, providing a common data source for the content of the WordPress site running on more than one instance."
  }
}, {
  "index" : 1536,
  "chapter" : 44,
  "number" : 12,
  "asking" : " You are changing your application to move session state information off the individual Amazon Elastic Compute Cloud (Amazon EC2) instances to take advantage of the elasticity and cost benefits provided by Auto Scaling. Which of the following AWS Cloud services is best suited as an alternative for storing session state information?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon DynamoDB"
  }, {
    "option" : "B",
    "description" : " Amazon Redshift"
  }, {
    "option" : "C",
    "description" : " Amazon Storage Gateway"
  }, {
    "option" : "D",
    "description" : " Amazon Kinesis"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 12,
    "options" : [ "A" ],
    "description" : "Amazon DynamoDB is a NoSQL database store that is a great choice as an alternative due to its scalability, high-availability, and durability characteristics. Many platforms provide open-source, drop-in replacement libraries that allow you to store native sessions in Amazon DynamoDB. Amazon DynamoDB is a great candidate for a session storage solution in a share-nothing, distributed architecture."
  }
}, {
  "index" : 1537,
  "chapter" : 44,
  "number" : 13,
  "asking" : " A media sharing application is producing a very high volume of data in a very short period of time. Your back-end services are unable to manage the large volume of transactions. What option provides a way to manage the flow of transactions to your back-end services?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Store the inbound transactions in an Amazon Relational Database Service (Amazon RDS) instance so that your back-end services can retrieve them as time permits."
  }, {
    "option" : "B",
    "description" : " Use an Amazon Simple Queue Service (Amazon SQS) queue to buffer the inbound transactions."
  }, {
    "option" : "C",
    "description" : " Use an Amazon Simple Notification Service (Amazon SNS) topic to buffer the inbound transactions."
  }, {
    "option" : "D",
    "description" : " Store the inbound transactions in an Amazon Elastic MapReduce (Amazon EMR) cluster so that your back-end services can retrieve them as time permits."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 13,
    "options" : [ "B" ],
    "description" : "Amazon SQS is a fast, reliable, scalable, and fully managed message queuing service. Amazon SQS should be used to decouple the large volume of inbound transactions, allowing the back-end services to manage the level of throughput without losing messages."
  }
}, {
  "index" : 1538,
  "chapter" : 44,
  "number" : 14,
  "asking" : " Which of the following are best practices for managing AWS Identity and Access Management (IAM) user access keys? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Embed access keys directly into application code."
  }, {
    "option" : "B",
    "description" : " Use different access keys for different applications."
  }, {
    "option" : "C",
    "description" : " Rotate access keys periodically."
  }, {
    "option" : "D",
    "description" : " Keep unused access keys for an indefinite period of time."
  }, {
    "option" : "E",
    "description" : " Configure Multi-Factor Authentication (MFA) for your most sensitive operations."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 14,
    "options" : [ "B", "C", "E" ],
    "description" : "You should protect AWS user access keys like you would your credit card numbers or any other sensitive secret. Use different access keys for different applications so that you can isolate the permissions and revoke the access keys for individual applications if an access key is exposed. Remember to change access keys on a regular basis. For increased security, it is recommended to configure MFA for any sensitive operations. Remember to remove any IAM users that are no longer needed so that the user’s access to your resources is removed. Always avoid having to embed access keys in an application."
  }
}, {
  "index" : 1539,
  "chapter" : 44,
  "number" : 15,
  "asking" : " You need to implement a service to scan Application Program Interface (API) calls and related events’ history to your AWS account. This service will detect things like unused permissions, overuse of privileged accounts, and anomalous logins. Which of the following AWS Cloud services can be leveraged to implement this service? (Choose 3 answers)",
  "answerOption" : [ {
    "option" : "A",
    "description" : " AWS CloudTrail"
  }, {
    "option" : "B",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  }, {
    "option" : "C",
    "description" : " Amazon Route 53"
  }, {
    "option" : "D",
    "description" : " Auto Scaling"
  }, {
    "option" : "E",
    "description" : " AWS Lambda"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 15,
    "options" : [ "A", "B", "E" ],
    "description" : "You can enable AWS CloudTrail in your AWS account to get logs of API calls and related events’ history in your account. AWS CloudTrail records all of the API access events as objects in an Amazon S3 bucket that you specify at the time you enable AWS CloudTrail. You can take advantage of Amazon S3’s bucket notification feature by directing Amazon S3 to publish object-created events to AWS Lambda. Whenever AWS CloudTrail writes logs to your Amazon S3 bucket, Amazon S3 can then invoke your AWS Lambda function by passing the Amazon S3 object-created event as a parameter. The AWS Lambda function code can read the log object and process the access records logged by AWS CloudTrail."
  }
}, {
  "index" : 1540,
  "chapter" : 44,
  "number" : 16,
  "asking" : " Government regulations require that your company maintain all correspondence for a period of seven years for compliance reasons. What is the best storage mechanism to keep this data secure in a cost-effective manner?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon S3"
  }, {
    "option" : "B",
    "description" : " Amazon Glacier"
  }, {
    "option" : "C",
    "description" : " Amazon EBS"
  }, {
    "option" : "D",
    "description" : " Amazon EFS"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 16,
    "options" : [ "B" ],
    "description" : "Amazon Glacier enables businesses and organizations to retain data for months, years, or decades, easily and cost effectively. With Amazon Glacier, customers can retain more of their data for future analysis or reference, and they can focus on their business instead of operating and maintaining their storage infrastructure. Customers can also use Amazon Glacier Vault Lock to meet regulatory and compliance archiving requirements."
  }
}, {
  "index" : 1541,
  "chapter" : 44,
  "number" : 17,
  "asking" : " Your company provides media content via the Internet to customers through a paid subscription model. You leverage Amazon CloudFront to distribute content to your customers with low latency. What approach can you use to serve this private content securely to your paid subscribers?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Provide signed Amazon CloudFront URLs to authenticated users to access the paid content."
  }, {
    "option" : "B",
    "description" : " Use HTTPS requests to ensure that your objects are encrypted when Amazon CloudFront serves them to viewers."
  }, {
    "option" : "C",
    "description" : " Configure Amazon CloudFront to compress the media files automatically for paid subscribers."
  }, {
    "option" : "D",
    "description" : " Use the Amazon CloudFront geo restriction feature to restrict access to all of the paid subscription media at the country level."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 17,
    "options" : [ "A" ],
    "description" : "Many companies that distribute content via the Internet want to restrict access to documents, business data, media streams, or content that is intended for selected users, such as users who have paid a fee. To serve this private content securely using Amazon CloudFront, you can require that users access your private content by using special Amazon CloudFront-signed URLs or signed cookies."
  }
}, {
  "index" : 1542,
  "chapter" : 44,
  "number" : 18,
  "asking" : " Your company provides transcoding services for amateur producers to format their short films to a variety of video formats. Which service provides the best option for storing the videos?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Amazon Glacier"
  }, {
    "option" : "B",
    "description" : " Amazon Simple Storage Service (Amazon S3)"
  }, {
    "option" : "C",
    "description" : " Amazon Relational Database Service (Amazon RDS)"
  }, {
    "option" : "D",
    "description" : " AWS Storage Gateway"
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 18,
    "options" : [ "B" ],
    "description" : "Amazon S3 provides highly durable and available storage for a variety of content. Amazon S3 can be used as a big data object store for all of the videos. Amazon S3’s low cost combined with its design for durability of 99.999999999% and for up to 99.99% availability make it a great storage choice for transcoding services."
  }
}, {
  "index" : 1543,
  "chapter" : 44,
  "number" : 19,
  "asking" : " A week before Cyber Monday last year, your corporate data center experienced a failed air conditioning unit that caused flooding into the server racks. The resulting outage cost your company significant revenue. Your CIO mandated a move to the cloud, but he is still concerned about catastrophic failures in a data center. What can you do to alleviate his concerns?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Distribute the architecture across multiple Availability Zones."
  }, {
    "option" : "B",
    "description" : " Use an Amazon Virtual Private Cloud (Amazon VPC) with subnets."
  }, {
    "option" : "C",
    "description" : " Launch the compute for the processing services in a placement group."
  }, {
    "option" : "D",
    "description" : " Purchase Reserved Instances for the processing services instances."
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 19,
    "options" : [ "A" ],
    "description" : "An Availability Zone consists of one or more physical data centers. Availability zones within a region provide inexpensive, low-latency network connectivity to other zones in the same region. This allows you to distribute your application across data centers. In the event of a catastrophic failure in a data center, the application will continue to handle requests."
  }
}, {
  "index" : 1544,
  "chapter" : 44,
  "number" : 20,
  "asking" : " Your Amazon Virtual Private Cloud (Amazon VPC) includes multiple private subnets. The instances in these private subnets must access third-party payment Application Program Interfaces (APIs) over the Internet. Which option will provide highly available Internet access to the instances in the private subnets?",
  "answerOption" : [ {
    "option" : "A",
    "description" : " Create an AWS Storage Gateway in each Availability Zone and configure your routing to ensure that resources use the AWS Storage Gateway in the same Availability Zone."
  }, {
    "option" : "B",
    "description" : " Create a customer gateway in each Availability Zone and configure your routing to ensure that resources use the customer gateway in the same Availability Zone."
  }, {
    "option" : "C",
    "description" : " Create a Network Address Translation (NAT) gateway in each Availability Zone and configure your routing to ensure that resources use the NAT gateway in the same Availability Zone."
  }, {
    "option" : "D",
    "description" : " Create a NAT gateway in one Availability Zone and configure your routing to ensure that resources use that NAT gateway in all the Availability Zones. Appendix A "
  } ],
  "feedbacks" : [ ],
  "rightAnswer" : {
    "domain" : 14,
    "number" : 20,
    "options" : [ "C" ],
    "description" : "You can use a NAT gateway to enable instances in a private subnet to connect to the Internet or other AWS services, but prevent the Internet from initiating a connection with those instances. If you have resources in multiple Availability Zones and they share one NAT gateway, resources in the other Availability Zones lose Internet access in the event that the NAT gateway’s Availability Zone is down. To create an Availability Zone- independent architecture, create a NAT gateway in each Availability Zone and configure your routing to ensure that resources use the NAT gateway in the same Availability Zone. Comprehensive Online Learning Environment Register on Sybex.com to gain access to the comprehensive online interactive learning environment and test bank to help you study for your AWS Certified Solutions Architect - Associate exam. The online test bank includes: Assessment Test to help you focus your study to specific objectives Chapter Tests to reinforce what you've learned Practice Exams to test your knowledge of the material Digital Flashcards to reinforce your learning and provide last-minute test prep before the exam Searchable Glossary to define the key terms you'll need to know for the exam Go to http://www.wiley.com/go/sybextestprep to register and gain access to this comprehensive study tool package. WILEY END USER LICENSE AGREEMENT Go to www.wiley.com/go/eula to access Wiley’s ebook EULA."
  }
} ]